[
  {
    "comments": [
      {
        "name": "Roger T. B.",
        "title": "\"The most versatile construction software.\"",
        "text": [
          "I like this system because it is one of the most complete and versatile I have used, it allows me to gather all the information about its different modules in an organized way. It has a very eye-catching and friendly interface, it is necessary before carrying out the management of this system to be able to take the training process offered by the technical support team, in order to be able to take advantage of all the functions offered by that system.",
          "This system has a very professional customer service team that allows to meet each of the needs arising in my work team, we have also suggested to this team that they can incorporate several functions that allow us to be more effective in our work. For the moment this team promised us that they would study the proposals and give us a quick response.",
          "At the moment this system is very useful for my business and I do not have any type of complaints regarding its functions, everyone in my company we are very satisfied with the use of this system.",
          "Definitely this system I recommend it widely, because it offers all the functions that my business needed. This software is not economical, but it is definitely worth having it.",
          "Thanks to this system, we have been able to order the entire management process, registering a constant productivity and in turn a surplus, leaving the board of partners very happy for the implementation of this system. This system has also brought us an improvement in the integration of the work team and in turn an improvement in the communication between teams."
        ],
        "time": "June 1, 2019",
        "Product": "G2 CROWD",
        "SentimentScore": -1
      },
      {
        "name": "Joey Z.",
        "title": "\"User experience in this program is horrible\"",
        "text": [
          "I just spend about 10 mins and I could not come up with anything that I \"like\" about Procore. Literally nothing come into my mind at all. However, once you jump on board it will be so hard to get rid of it or trust any other developer. Good thing is they always have a customer experience team that can explain to you why something does not work and they are fully aware of it.",
          "User experience is so bad. Every time I use procore it feels like I am using something from 10 years ago. As I said, their team will explain to you why something does not work and they knew about it but there will be no fix for it. You will just have to go around it which makes me feel really stupid. Most of the time is to delete everything possible and restart. Not what I am looking for.",
          "To show owner that we have this so it feels like you are qualified. But these days, more and more owner respond with \"oh god\" when we mention this."
        ],
        "time": "May 16, 2019",
        "Product": "G2 CROWD",
        "SentimentScore": 1
      },
      {
        "name": "Caleb P.",
        "title": "\"Create efficient engineering projects\"",
        "text": [
          "The drawing tool to review and track the drawings that are currently being designed and also for those that have been previously designed, this serves to have control over the designs that have been created or are being created and to be able to make modifications in real time.",
          "It has a shipping tool that allows sending contractors to perform specific tasks in the company. Through this tool they are specified what needs to be done so they know what tasks they should address. It is really useful for business outsourcing.",
          "Daily records serve to keep track of tasks and jobs developed within the company and serve to analyze them later and see if changes should be made.",
          "To modify the font and size of the text in the drawing tool you must use a long bar that is inside this tool to make those changes. I think that this process could be simplified by changing the way we add and modify the text.",
          "When you save some new person inside a directory and leave an unfilled field, when saving is deleted and you must start everything from the beginning. It would be easier to save all the information that has already been filled and then have to fill in what is missing, the procedures would be streamlined because when you add many people too late if you make a mistake.",
          "Procore helps you to design more easily constructions in your company, so that external contracting is easier to do and also to keep track of the work done. It is a tool that increases the contol on those elements.",
          "It has helped us a lot to design new constructions for our warehouse, since with its tools it is much simpler to edit and you can make any changes quickly, without having to recreate everything from scratch if there is an error or Design flaw",
          "We have a simpler control of the tasks and jobs that each employee and part of the company has carried out, which helps us to have control over what our employees do and the achievement of our objectives."
        ],
        "time": "March 22, 2019",
        "Product": "G2 CROWD",
        "SentimentScore": 1
      },
      {
        "name": "Gonzalo J.",
        "title": "\"Great tool for construction documentation\"",
        "text": [
          "1. Very easy to enter information and easy to learn.",
          "2. Useful with construction people often not so \"computer friendly\".",
          "3. The notifications for overdue or expired items keep everyone informed and aware of the important things that need to be completed.",
          "1. Needs more work on cross-referencing information.",
          "2. A stand-alone version could help with projects with limited or slow Internet access, very common in projects in remote areas. That way, information could be entered immediately and then later uploaded when better a better Internet connection is available.",
          "Consider availability of Internet access in the projects you intend to use the software as it will not work stand alone. The strength of the software relies on a good Internet connection; otherwise, it becomes frustrating to use.",
          "1. Making sure that projects are adequately documented. We have made keeping all records completed a requirement for the approval of monthly invoices.",
          "2. Making it easy to manage RFI, Submittals and other instruments that require multiple levels of review.",
          "3. Keeping the owner involved / informed.",
          "4. Making sure that quality issues like observations and Punch List items are well attended and are not left behind, even when stakeholders of the project are changed.",
          "5. Bidding processes have become more transparent and easy to manage as distributing updated information is as easy as making a couple of clicks."
        ],
        "time": "March 22, 2019",
        "Product": "G2 CROWD",
        "SentimentScore": 0
      },
      {
        "name": "Amber T.",
        "title": "\"Great Project Management Software!\"",
        "text": [
          "The submittal features are amazing for me! It made tracking submittals and O & M documents so much easier for me to find when needed. Also being able to look at plans and specs remotely was very helpful. The customer service is amazing and all of the staff trainings were planned out. It is just hard in the construction world to get construction workers that never look at the computer or use apps to pick up this software and use it.",
          "Procore is a very expensive product. With small projects it is really not needed. When trying to save money and going from Submittal Exchange it really did not help very much. It felt like I was constantly walking the guys through their processes. When they needed to look up something I would have to walk them through every time. There really needs to be more trainings geared towards the construction worker that does not use electronics on a regular basis. Our guys in the field feel that it is easier to pick up a set of plans and look at them than it is to try and look the app over on their phone. The app had too many bugs for them to use. For the app the sumbittal software was limitied so when working remotly I had to use a computer not a cell phone or tablet. It is good, but it really does not save our company any money or time, when I am having to walk the guys through every step of the way.",
          "This software needs to be budgeted into jobs better. When trying to cut overhead in our office this was one of the first things to go.",
          "Tracking Tracking Tracking! This is great software to keep a record of documents and reference them from anywhere at anytime."
        ],
        "time": "March 20, 2019",
        "Product": "G2 CROWD",
        "SentimentScore": 1
      },
      {
        "name": "Jeff M.",
        "title": "\"Good web-base software to manage project documents\"",
        "text": [
          "Procore does a good job of bringing all of the different construction document administration tasks into one centralized tool that is organized, collaborative, and easy for new users to pick up on. The developers of the software seem to receive feedback from users and update regularly to improve tools and change interfaces to better suit the customer. Overall Procore seems to be the benchmark company for construction document control, and is heading in the right direction.",
          "Some parts or tools of Procore are still a little bulky and may be difficult on a spotty construction internet connection. Submittal logs, RFI registers and some of the drawings may take a little bit of time to load on your computer due to the way Procore draws up their lists.",
          "Procore's marketing and BD team seems to be very well in tuned with customer needs. I'm sure they offer trials or demo's to those considering Procore.",
          "Procore has made document management easy for commercial construction."
        ],
        "time": "November 24, 2018",
        "Product": "G2 CROWD",
        "SentimentScore": 0
      },
      {
        "name": "Kenneth P.",
        "title": "\"Procore, a software with a lot to offer\"",
        "text": [
          "The ease of sorting documents, RFI, PCO's, Drawings, sub lists, etc.",
          "One thing that I dislike is that you cant sync multiple accounts together. Being able to sync between accounts helps alleviate the need of having to ask or reach out to different individuals looking for certain items that only a specific person has access to. This would make the software a little more user friendly as there have been many times where myself or co-workers were looking to access documents like PCO's or RFI's and we are not able to view them regardless of the permissions set by the contractor. This delayed us when it came to approving off on certain documents as we were unable to access them in a timely manner. I think it should be considered, if not done so already, to allow multiple users or accounts to sync together so information can be more easily communicated.",
          "Make sure to focus during the live training sessions, it is not difficult to pick up, but a lot of information is passed down.",
          "We are not able to utilize Procore like we want to without being able to sync between our account and the contractors. Making it difficult to keep up/track certain documents. A benefit I have realized is when not counting on the ability to sync between accounts, it is easy to keep track of your own documents by having them all in one easily accessible location."
        ],
        "time": "October 16, 2018",
        "Product": "G2 CROWD",
        "SentimentScore": 0
      },
      {
        "name": "Bethany L.",
        "title": "\"Great Program, but a little pricey\"",
        "text": [
          "Procore is a great tool that helps our company to keep all of our information in one place. We are able to integrate records from the majority of other programs to minimize the number of times that we have to repeat steps. Our subcontractor invoicing is very efficient as well and allows for subs to quickly bill. I love that Procore is always making improvements based on suggestion and is willing to help us create what we need in order to have a smooth running system. Their staff helps us to customize the features to align with our processes versus us having to rework our entire workflow to match a program.",
          "Procore is one of the more expensive systems that we have utilized. In order to get all of the functionality, you often have to purchase more than one subscription with various add-ons. We often have to get subscriptions to other programs for the missing information. Wish the management system had estimating and scheduling software included.",
          "It is important to research beforehand what subscriptions are needed for your company, but we love the Procore Sync functionality that functions like Dropbox and allows subs to upload items into the folders you give them access to.",
          "Procore is consistently a work in progress, but it has helped us to create more standardization in the company. It has increased collaboration and dissemination of information, increased accountability and transparency, and has centralized data storage allowing employees, owners, and subs to access information on different devices and platforms whether working in the office or field."
        ],
        "time": "October 16, 2018",
        "Product": "G2 CROWD",
        "SentimentScore": 1
      },
      {
        "name": "K G.",
        "title": "\"Procore is a great tool for our day to day project management needs\"",
        "text": [
          "I like having everything project related tracked and managed within one program.",
          "The ability to integrate with Spectrum is great.",
          "The interface is all very user friendly and intuitive.",
          "I really like being able to suggest changes and then track the implementation.",
          "Off the top of my head, some areas for improvement would be:",
          "The ability to distribute a submittal package instead of each individual submittal would be great.",
          "Creating a submittal register is VERY time consuming and tedious.",
          "It would be very helpful to see a user's permission template on the directory page without having to click edit.",
          "The way specifications and drawings are handled with Procore has solved a lot of issues we were having with the organization of drawing sets, revisions, sketches, etc.",
          "Our company ran into some problems with submittals. There were some long delays, losing track of submittals, he said/she said of submittals being turned in or not. With Procore, there is a lot less risk of lost or delayed submittals. The data is all tracked so there's no way to say something did or didn't come in without Procore having the evidence of it.",
          "The scheduled report distribution has been great in many ways. Since the superintendents need to have their information logged before the report goes out , we have seen a big improvement in the timeliness of the daily reports."
        ],
        "time": "October 16, 2018",
        "Product": "G2 CROWD",
        "SentimentScore": 1
      },
      {
        "name": "Chris H.",
        "title": "\"Simplifying the Project Management Landscape\"",
        "text": [
          "The ability to reduce the discrepancies between the office and site. This allows all the information we take for granted in the office to be easily accessible by all site staff. The IOS user interface is very easy to use. It allows information to be accessed and modified from anywhere.",
          "Training some of the more seasoned staff can be a chore. Years and years of habits need to be broken to properly appreciate Procore and what it can do for these team members. Easier said than done. Pricing can be seen as a bit of a deterrent as well since it is a lump sum (1) year cost. This is offset once you take into consideration the complexity of all of the available tools.",
          "Prepare to have all of your information in one place and accessible from anywhere. Once everyone is onboard, you can basically forget your old ways.",
          "Problems:",
          "- Uptake by Subcontractors and Sub consultants",
          "- Integrating with our current accounting system Quickbooks",
          "Benefits:",
          "- All information in 1 place",
          "- Garners a connection between the site and office",
          "- Allows our Ownership groups for projects the ability to be integrated into the project",
          "- Our construction estimates are now easily accessible with all of the project data. This allows the Project Manager to integrate with the estimator.",
          "- Reports are great to pass along to customers, they take no work and look professional in meetings"
        ],
        "time": "October 16, 2018",
        "Product": "G2 CROWD",
        "SentimentScore": -1
      },
      {
        "name": "Amanda G.",
        "title": "\"Great Project Management Software\"",
        "text": [
          "I loved the people at procore! they were amazing when we were setting up and training. Especially the sales team. She sent me a few books for my daughter and we still read them together! :)",
          "I also like the recommend a feature option. I have found that others want the same things i do!",
          "When it locks up and you can't get in for a while. Luckily it hasn't happened too much! Can be a little pricey. Especially compared to what we were paying before.",
          "Use the training and keep an open mind! When I was an outside user and had to use procore I couldn't stand it! but once you understand it more and know how to tweak certain things it is much easier to use!",
          "Submittal tracking is the main reason we use it. change orders, proposed change orders."
        ],
        "time": "October 16, 2018",
        "Product": "G2 CROWD",
        "SentimentScore": 1
      },
      {
        "name": "Mark L.",
        "title": "\"It has been very frustrating at times.\"",
        "text": [
          "The project management tools are solid, the commitments are great, and the CO's are good, but the process is clunky. The daily log is very useful and the budget tool is the most useful tool there is.",
          "The financial tools are a mess. We lose so much time on billing every month that it has cost us more money in time than it has saved us. For this reason alone, I am having a hard time justifying the cost. There is no cost plus model set up either which makes no sense at all, since it is essentially the budget tool, but with less lines...?",
          "The budget tool as helped with tracking overall budget with CO's, but as soon as it gets to the pay app, it all falls apart"
        ],
        "time": "October 18, 2018",
        "Product": "G2 CROWD",
        "SentimentScore": -1
      },
      {
        "name": "carlos g.",
        "title": "\"\"Procore will save you time and money\"\"",
        "text": [
          "-The mobile application is easy to use.",
          "-It helps to create presentation records from specifications with less PM input.",
          "-Tracks changes in commitments (subs and purchase orders).",
          "-It helps to label and organize the loaded plans and specifications without a lot of comments from the PM.",
          "-Work with clients to customize.",
          "-It has a capacity to respond to suggestions for customer improvement.",
          "-Involves the end users in future planning",
          "product launches and tool improvements.",
          "-The photo tool should be able to link the photos in almost all the tools directly from the tool.",
          "-The offer module does not update the subcontractor's information automatically as BuildingConnected.",
          "-Some of the financial integrations can be difficult depending on your workflow.",
          "-Sometimes the drawings take an eternity to download.",
          "Procore has completely transformed our planning. The commitment tool allows us to forecast the cost in real time. It also gives us real ETAs. The budget tool helps our PM to see the big picture and how each purchase can affect the final result. It also sends a clear picture of where mistakes or purchases occur.",
          "We use Procore to provide better integration between project managers, field staff, management and subcontractors. He does a great job making plans in the field in a timely manner and assisting with field reports, photos and reminding those involved with his ball court process, etc."
        ],
        "time": "June 21, 2019",
        "Product": "G2 CROWD",
        "SentimentScore": 1
      },
      {
        "name": "cheryl p.",
        "title": "\"great software\"",
        "text": [
          "I like this framework since it is a standout amongst the most complete and flexible I have utilized, it enables me to accumulate all the data about its various modules in a composed manner. It has a very attractive and well disposed interface, it is important before doing the administration of this framework to have the option to take the preparation procedure offered by the specialized help group, so as to have the option to exploit every one of the capacities offered by that framework.",
          "This framework has an exceptionally proficient client administration group that permits to address every one of the issues emerging in my work group, we have likewise recommended to this group they can join a few capacities that enable us to be increasingly viable in our work. For the minute this group guaranteed us that they would contemplate the recommendations and give us a fast reaction.",
          "To adjust the textual style and size of the content in the illustration apparatus you should utilize a long bar that is inside this device to roll out those improvements. I imagine that this procedure could be rearranged by changing the manner in which we include and alter the content.",
          "When you spare some new individual inside an index and leave an unfilled field, when sparing is erased and you should begin everything from the earliest starting point. It is simpler to spare all the data that has just been filled and afterward need to fill in what is feeling the loss of, the methodology would be streamlined on the grounds that when you include numerous individuals past the point of no return whether you commit an error.",
          "This product should be planned into occupations better. When attempting to cut overhead in our office this was one of the principal things to go.",
          "1. Ensuring that activities are satisfactorily recorded. We have made keeping all records finished a prerequisite for the endorsement of month to month solicitations.",
          "2. Making it simple to oversee RFI, Submittals and different instruments that require numerous dimensions of survey.",
          "3. Keeping the proprietor included/educated.",
          "4. Ensuring that quality issues like perceptions and Punch List things are very much visited and are not deserted, notwithstanding when partners of the undertaking are changed.",
          "5. Offering procedures have turned out to be increasingly straightforward and simple to oversee as circulating refreshed data is as simple as making two or three ticks."
        ],
        "time": "June 19, 2019",
        "Product": "G2 CROWD",
        "SentimentScore": -1
      },
      {
        "name": "Neree G. C.",
        "title": "\"How Procore has changed the way the industry does business!\"",
        "text": [
          "The most powerful part of Procore is the collaboration it cultures between all the departments of our company. The combination of mobile software, integrations, and the web allows every member of the project team to communicate information in real time. This in turns allows for more time actually managing the project and reducing the time commitment of team members administrative responsibilities.",
          "My role is solely to implement and facilitate the use of Procore within our company. Procore has made helpful how to documents, training videos, and online courses available to all its users. The biggest challenge I find is that quite often users have no idea these resources exist. This leads to frustration with the product, an unwillingness to adopt, or the product not being maximized to its fullest potential. .",
          "Procore is an excellent construction management software! The biggest gains we have found have been with our teams in the field. The mobile tools have allowed us to quickly communicate and track issues between employees and subcontractors all in one collaborative place. Here in Australia we have had some challenges with the financial tools, but back in the US those tools work very well. In addition, there are many API integrations available to help meet your company's needs (Docusign, MS Project, P6, ect). In my opinion, no matter the size of your company, Procore can improve your business, promote transparency between organizations, and save you money.",
          "Improving the communication between the site and management has allowed our Project Managers to gain a better picture of their project while not having to be physically on site. In addition, the tool is allowing our site teams to better track and call out any issues in order to ensure that our punch list and additional costs are minimized. I am also hoping to make the switch to the Training Center in the coming months to improve how we direct our employees on how to use the product."
        ],
        "time": "April 10, 2018",
        "Product": "G2 CROWD",
        "SentimentScore": 0
      },
      {
        "name": "Mike P.",
        "title": "\"Intuitive, user friendly, and great support; Procore\"",
        "text": [
          "The ability to share documents and large files without making customers create another account for a service that they will only use for a short duration project.",
          "The amount of work required to get drawings into the drawing tool, I do however understand the necessity of the process. The tool is very powerful and if you can afford the time to add drawings properly you can accomplish a lot of useful time saving tasks.",
          "Contact their team. They can tailor a package specifically to meet your needs.",
          "The greatest benefit that we have realized the quickest is that some of the agencies we deal with do not allow registration to outside file sharing sites (i.e. dropbox) that require accounts. They also lack the ability to receive files larger than 5 meg. This is a problem because most of our smallest reports exceed the limit. Procore has no size limit and does not require users to \"register\"."
        ],
        "time": "December 27, 2017",
        "Product": "G2 CROWD",
        "SentimentScore": -1
      },
      {
        "name": "Internal Consultant",
        "title": "\"Procore Review\"",
        "text": [
          "The best thing about it is its ease of use and convenience. It is easy enough to figure out how to use. We've had a number of otherwise resistant individuals who were able to get over the hurdle of the learning curve and have learned to like it",
          "The software is on the expensive side. The price tag for Procore as a percentage of project dollar volume in terms of a yearly expenditure can be a tough commitment to face.",
          "As is the case with any software implementation, you definitely need to have a plan in place. Procore offers a lot of help in this area and will aid in guiding you through the process. But you will want to have the right processes and people in place internally to help maximize your success. Not having the right people on the bus and in the right seats will only aid the resistance to change.",
          "Documentation of submittals, RFIs, issues, photos, drawings"
        ],
        "time": "March 20, 2019",
        "Product": "G2 CROWD",
        "SentimentScore": 0
      },
      {
        "name": "Administrator",
        "title": "\"Real Time Project Management Onsite or Off\"",
        "text": [
          "The ability to see up to date information real time whether we're on site or off. Sharing of data, drawings and scheduling is easy and notifications are a click away for the team.",
          "Can lag at times and the directory could use some upgrades.",
          "Procore provides the ability to have all your project, contact and scheduling information in one location, assists you in tracking your costs, meetings, communications and more at a click of the mouse. Whether onsite or in the office, each team member will have access to all the data, be able to update as needed, add photos, upload documents and drawings and share information easily. A great tool for a Project Manager freeing up time to focus on the Project not the administrative part and paperwork.",
          "We are able to analyze each project, see where we need to focus and adjust on costs and time for the next. It helps us become better Project Managers and General Contractors."
        ],
        "time": "March 20, 2019",
        "Product": "G2 CROWD",
        "SentimentScore": 0
      },
      {
        "name": "Ben C.",
        "title": "\"Great for subcontractors\"",
        "text": [
          "Procore easily allows our most important resource, our workers in the field, to always have access to the most up to date drawings and specifications. I never have to worry about re-work due to outdated drawings anymore.",
          "With notifications, I, along with my team in the filed, can quickly see any issues that we need to take care of. Procore also allows us to easily respond back showing the fix!",
          "The iOS app for the iPhone, needs to be streamlined. It can be clunky, and take time to get to a certain drawing. When you have a large amount of files/drawings in a project, it can take quite a bit of time to load it as well.",
          "If you are a subcontractor, I would recommend waiting until a GC or CM requires it, or offers it for free to all users on a large project.",
          "It saves time for our field leaders to go back to look at a set of drawings. No matter where they are located on a project, they always have access to all of the drawings, for all trades"
        ],
        "time": "January 12, 2018",
        "Product": "G2 CROWD",
        "SentimentScore": -1
      },
      {
        "name": "chelsea s.",
        "title": "\"ProCore Survey\"",
        "text": [
          "We have 2 branches to our company (one located in Hawaii and the other in LA). We use Procore for both branches to keep track of projects and to pass along important documents. We also use it to issue Contracts, Sub-contracts, Changes Orders, etc. Procore allows us to easily provide our clients with one place to find all their documents (plans, contracts, contact information, etc), which would otherwise be lost within tons of emails.",
          "The online video demonstrations of how to use all of ProCores tools can be a little hard to watch. It's not that the videos are particularly difficult to understand, but the aren't the most stimulating thing to sit through and watch. They tried their best to break it down by providing quizzes and shorter videos, but when you look at how much material there is to learn in one course, it's daunting.",
          "Making the learning process easier. Clients and subcontractors generally don't have the time it takes to learn ProCore--which makes it difficult to encourage them to use.",
          "Manages and uploads plans to one place and allows for drawing edits for all appropriate parties to see.",
          "Allows users to make changes to things that have been submitted, while also automatically informing all appropriate parties of the changes.",
          "Sends reminders to clients and subcontractors about answering RFIs that would otherwise have been forgotten about."
        ],
        "time": "December 12, 2017",
        "Product": "G2 CROWD",
        "SentimentScore": 0
      },
      {
        "name": "Steven S.",
        "title": "\"Fantastic Software\"",
        "text": [
          "The drawings tool is brilliant, the functions and features available save so much time working.",
          "The software is still US based and there are various elements which are not so relevant to the UK industry or are missing, such as a dedicated CVI tool.",
          "We have had difficulties getting the companies we work with to fully commit to using the system so it advised to set up workshops and try to be strict upon its implementation across the board on projects.",
          "Procore keeps track of everything for us and we have certainty that all documents and emails are stored and available at anytime. It provides so much additional security."
        ],
        "time": "March 20, 2019",
        "Product": "G2 CROWD",
        "SentimentScore": 1
      },
      {
        "name": "User",
        "title": "\"Best out of the Box Option\"",
        "text": [
          "Procore includes all the project managment tools you need to effectively manage a project. The web based software takes the place of many of the old spreadsheets that we would typically keep for a project. The support is wonderful as they allow you options to chat, e-mail, and phone 24 hours a day.",
          "As the software is out of the box there are some tools that don't work quite like I'd like them to. I wish we could customize things a little more. We were fairly early adopters of the software and it felt like earlier on they would cater more to your individual company. Now that there bigger I don't think they can do that.",
          "Unless you want to design something from scratch this would be the way to go.",
          "RFI logs, submittal logs, change order tracking, drawing logs, benefits include time savings, less duplicate entries, and less holes in the process as things are run more smoothly through procore."
        ],
        "time": "January 15, 2019",
        "Product": "G2 CROWD",
        "SentimentScore": -1
      },
      {
        "name": "Chris H.",
        "title": "\"a VDC/BIM perspective\"",
        "text": [
          "The simple concepts that everything you need is at your fingertips and everyone is reading the same sheet of music (as long as you have internet access). These simple concepts are half the battle; if adhered to it allows clarity of information, accountability, meaningful collaboration.",
          "It's expensive and I've found some features in other products that I would like to see in Procore. If you are trying to be a one stop shop, it's important to either keep up with the Joneses or at least have them consider you family. That way you can get rid of your other software and defer the additional costs for Procore.",
          "It's expensive, If you even plan to test it out, really learn and utilize it. Watch videos and buy into their community. This isn't a dip your toes in software or you may not get back the value of your investment.",
          "What's being solved is the issue of dated software and processes. Procore exists in the now with current main stream technology such as cloud computing, OCR, API integration, online collaboration, etc... The benefit is that from on site meetings to conference calls, to off site meetings, all the information I need for my project is accessible and can be quickly referenced."
        ],
        "time": "November 10, 2017",
        "Product": "G2 CROWD",
        "SentimentScore": 1
      },
      {
        "name": "Lanita C.",
        "title": "\"Procore for Efficiency\"",
        "text": [
          "1) The drawings automatically pull the most current to the front.",
          "2) Accessibility from the field",
          "3) Financials",
          "You can get lost in the rabbit hole so to speak. There is so much and it goes so deep. If there were more individual classes offered for training that would be stupendous. The training videos are a great resource but it's hard to retain such a wealth of information in one sitting.",
          "Well worth the investment. Unlimited storage space, customization options, etc. IF you try it and like it, just consider integration as well. We are going to implement it and it will be our total and only well rounded tool .",
          "The main business problems we are solving are 1)communication - everyone is able to stay on the same page really easily. 2) Accountability. The ball in court assigns and tracks who is responsible for what. It is really reallly great."
        ],
        "time": "November 10, 2017",
        "Product": "G2 CROWD",
        "SentimentScore": 1
      },
      {
        "name": "Jeffrey Y.",
        "title": "\"Procore is very ineffective\"",
        "text": [
          "Everyone in this office and everyone on the contractor side hates procore because it is very hard to use. Transmittal feature sucks too because you have to \"add\" the document after you already uploaded it.",
          "Everything. I had a lot of issues with Procore since day 1 of using it. I contacted the design team and support team but nothing could be resolved. I was given excuses of saying it is impossible to make the changes I am asking and that I have no right to make any request for changes as I am ONLY a project admin . ONLY the COMPANY admin can make request changes but the Company admin rarely uses Procore on a daily basis. The project admins use Procore on a daily basis and cant make any requests. My request to me is very simple because all I asked for is to make sure that if the RFI or Submittal signature line at the bottom to be on the same page as the rest of the content. As the issue is that 99% of the content when printed out is on page 1 but the signature and only the signature line is on page 2. This looks very weird and I asked for this to be fixed. There were also many things I asked for such as multiple reviewer to be assigned in as Ball in Court for RFI and other features I deem as important to my job. Every time I ask i was denied or asked to put it in as an idea. After a year none of these issues have been resolved and procore is still very not flexible.",
          "Load screen is very slow, implementation is very slow, very hard to use, not flexible, pay app is hard to modify especially if changes were done on a previous pay app or new modifications of the scope.",
          "We are the construction managers of this project but we don't see any benefit of Procore. The only reason we use procore is because we are told to use it. We only use it to track official documents and nothing else."
        ],
        "time": "November 10, 2017",
        "Product": "G2 CROWD",
        "SentimentScore": 0
      },
      {
        "name": "Celeste L.",
        "title": "\"Streamlines work, increases communication\"",
        "text": [
          "I really like the ability of Procore to link to Quickbooks as well as the ability to track RFI's, submittals, emails for a job all in one place. I think for such a complex program, it's very user friendly...even for our not so tech savvy employees.",
          "We are a small, but growing quickly company, and I wish that there was a way to go back and redo some things...where we started is not where we need to be (cost codes for instance), and we've learned so much and changed some of plans and practices, it would be nice to be able to have a clean state for new projects.",
          "Go thru all of the tutorials, they are so helpful in utilizing all of Procore's features",
          "Our biggest challenge is getting vendors/customers on board with utilizing Procore. Most are very receptive and jump on board quickly, but a few insist on working outside of Procore, and then we are forced into entering the information in Procore separately. The benefits for our company have been huge...we've been awarded some large projects, and I honestly don't know how we'd track them without Procore."
        ],
        "time": "November 10, 2017",
        "Product": "G2 CROWD",
        "SentimentScore": -1
      },
      {
        "name": "Bryan W.",
        "title": "\"Drawings, Specifications and RFI tools are fantastic!\"",
        "text": [
          "- Making their software very user friendly. Pretty easy to learn, and customizable to fit our needs.",
          "- Providing excellent customer support, where the people are always friendly, and readily available (not a 15 minute hold time away).",
          "- Developing an easy platform to navigate large project drawing books quickly, compare drawing revisions, and make notes on the drawings.",
          "- It's expensive and may be hard to justify for smaller construction companies.",
          "- Their OCR still has trouble reading \"handwriting\" fonts, which can really slow down the drawing uploading process.",
          "- Their Drawing system will not flip pages within a PDF. Occasionally, a GC will send us the pages turned portrait instead of landscape, and we have to use third party software to flip the pages the correct orientation.",
          "Procore is well suited for any construction industry business, making it simple to keep all of your project documents and budget handling all in one place. As I mention a lot in this review, the Drawings, Specifications, and RFI tools help make our job a lot easier, and, from what I understand from our other departments, the budget management tools work very well for what they need them to do. The downside, again, is that it is expensive, and a construction industry business would have to be doing quite a bit of projects, in my opinion, to justify the cost.",
          "- Saves time in sorting drawings and specifications.",
          "- Saves time in compiling drawing notations for RFIs.",
          "- Saves time in being able to quickly compare drawing revisions, and confirm which revision is the most recent."
        ],
        "time": "November 9, 2017",
        "Product": "G2 CROWD",
        "SentimentScore": 0
      },
      {
        "name": "Van R. J.",
        "title": "\"Procore\"",
        "text": [
          "Procore is an essential tool to our management team and clients. It allows us to submit large files to our clients and get tracked responses. We can also easily see updates in the filed for our Supervisors. It allows us to perform Pre-bid site visits and take pictures that will be displayed on the drawing location so there is not a question of the picture location.",
          "Procore does not support Sage 100 and we are unable to use the financials. The financial portion would tie in all our bids, budgets and give us one tool instead of two.",
          "Procore is a great tool for companies expanding to 3 or more project managers. Tracking all jobs with the click of a mouse makes my life easier.",
          "Weekly and monthly reviews are at our fingertips for updating and reviewing project updates. Site pictures can be viewed instantly from any location on my phone, I pad or computer."
        ],
        "time": "November 9, 2017",
        "Product": "G2 CROWD",
        "SentimentScore": -1
      },
      {
        "name": "Sean M.",
        "title": "\"How can you go wrong with this program\"",
        "text": [
          "The organization and tracking of construction documents, drawing tools, RFI's, tracking of submittals, trade contact information based on the project. Scheduling is amazing and easy to track delays via change orders, weather, or whatever occurs, The support centre is always available to answer any questions and you can do that via a live chat or the phone. They really have the customer and customer satisfaction in mind",
          "The accounting system for Canada needs some work. The GST is not an automatic calculation and needs to have a line within the budget to be processed. The reports aren't as customizable as I would like and the requisitions aren't as easy to work with",
          "This program is so intuitive, it shows everything in an easy to follow manner that is so sequential with all of the daily work that people in the construction profession utilize on a daily basis. More and more general Contractors are utilizing this program and the subtrades are seeing it daily within the construction industry. It is the easiest to utilize in my opinion.",
          "We are ensuring that trades and engineers are maintaining dates that were being missed. The dashboard is incredibly handy"
        ],
        "time": "November 8, 2017",
        "Product": "G2 CROWD",
        "SentimentScore": 0
      },
      {
        "name": "J.D. B.",
        "title": "\"Great move for our department.\"",
        "text": [
          "System is user friendly. We have deployed for projects of all sizes and the product works well regardless of the project size or scope. The system setup was straight forward and required very little training for administrator staff to begin populating with custom information. The system is sold with custom form process so that you can implement custom work flows and reporting tools into the system so that you can maintain current business processes without being molded to a software system. My staff immediately bought in to the system as a \"way of life\"... not a tool.",
          "The changes in the software are great but it requires a dedicated person on staff to focus on how the changes impact current configurations. The frequency of updates is difficult to follow what is changing... but progress is essential and needs to be considered when I say this is a concern.",
          "Think about user interface. People that need to learn an awkward user interface are unlikely to fully embrace the software. Cost is a factor, but you must also consider implementation and training time in that calculation. Many software packages are cumbersome and require repeat training. Procore is streamlined and provides a simplistic approach at a fairly routine and industry proven construction process.",
          "Improved construction process efficiencies in our office and in the office of the contractors we hire. This solves the communication puzzle with multiple entities providing feedback in a common location, where responses are realtime and data is shared accordingly."
        ],
        "time": "November 7, 2017",
        "Product": "G2 CROWD",
        "SentimentScore": 1
      },
      {
        "name": "Jim R.",
        "title": "\"The obvious choice\"",
        "text": [
          "Procore is the obvious choice - it’s the iPhone of construction software: it does everything well, is totally intuitive, and it’s getting further and further ahead of its peers all the time. And like the iPhone, those great features mean that more and more users are joining the Procore community all the time, which is a great feature unto itself. Just by mentioning that we use Procore gives us instant credibility with clients, subcontractors, designers, and prospective employees. And because many in those groups have already used Procore, it becomes that much easier to implement.",
          "Not much to say here. The biggest space for improvement I see is bringing in more detailed data from our accounting software (Sage) so that our PMs can get all the data they need right within Procore.",
          "Do as much in Procore as you can as soon as you can to take best advantage of the efficiency gained by the integration of features.",
          "The biggest single improvement we are seeing is improvement to our consistency of process and client experience across our projects."
        ],
        "time": "November 7, 2017",
        "Product": "G2 CROWD",
        "SentimentScore": 1
      },
      {
        "name": "Administrator in Construction",
        "title": "\"Procore\"",
        "text": [
          "I like that the program is web based and accessible from anywhere with an internet connection. It is intuitive. And has some great tools for project managements",
          "There are some issues we have with invoicing and calculating tax for Washington State. I would prefer to have one account manager to contact with issues instead of a generic phone line or email. Additionally, I would like to see customization for no additional charge, or at least an allotted amount of hours. Would like to see the price come down.",
          "All construction management software has its issues. While it does not solve every problem it does streamline some process and allows for great tracking. I would recommend talking to other users to see their experience and if it is worth the money.",
          "Streamlines many project management processes such as submittals, rfi's, change orders, etc."
        ],
        "time": "March 21, 2019",
        "Product": "G2 CROWD",
        "SentimentScore": 0
      },
      {
        "name": "William T.",
        "title": "\"One stop shop for project management\"",
        "text": [
          "All project information is contained in one system (financial, construction documents, commitments, etc.)",
          "The ipad/iphone apps do not have the same features as the web based app.",
          "Also, there is no sync between 2 companies that use procore.",
          "Make sure accounting software is compatible and can sync with Procore. Make sure subcontractors, suppliers, architects/engineers, and owners are on board with using the software for processing project documents. Develop a plan for rolling the software out internally and use a small number of projects to start so that any potential conflicts with other systems can be caught and resolved before additional projects are rolled out on the platform.",
          "timeliness of document processing as compared to other systems"
        ],
        "time": "October 16, 2018",
        "Product": "G2 CROWD",
        "SentimentScore": 0
      },
      {
        "name": "Corinna G.",
        "title": "\"Procore Gets the Job Done\"",
        "text": [
          "Managing submittals, RFI's and Change Orders is working out great. Support has been good. Also enjoy that it is cloud-based and there isn't a limit to users. Users in the field can use the app and access the program.",
          "Pay applications are clumsy. Would like them to be more customizable with specific tax needs. Also, integration with our accounting software leaves a lot to be desired. Successful use of the program depends on others using it as well (suppliers, subcontractors, engineers, etc.) so there is effort in getting others to buy in to the usefulness.",
          "We are keeping better track of submittals as long as all parties involved in the process use Procore. Like the Procore App as well as Procore Drive. We have yet to use the bidding side of Procore but look forward to trying this out. I use Procore on a day to day basis and enjoy using it. The support is great and there are many self-guided learning tools, including Webinars, forums, and also a Certification program."
        ],
        "time": "October 29, 2018",
        "Product": "G2 CROWD",
        "SentimentScore": -1
      },
      {
        "name": "Administrator",
        "title": "\"User Friendly Data Program\"",
        "text": [
          "This program is so user friendly. Cuts the work time down being able to drag and drop, upload documents and this program is customizable to meet the needs of the staff using this program while allowing access to outside companies to share and work within the same data program(s). It's almost an all-in-one data program for everyone to use at your fingertips.",
          "Unfortunately, PROCORE has the WORST Internet Connection speed when in use! PROCORE should have the Highest Connection Speed Available to their clients over the internet no matter what internet program is being used. PROCORE should have hardly to no, wait times when uploading big gigabyte documents into the system. It should not stall and need to be rebooted constantly, while trying to work within PROCORE. As a client who uses PROCORE daily, I spend more time waiting for PROCORE to upload anything while in use. THIS IS THE WORST, when you work on multiple projects daily in PROCORE. THIS SHOULD NOT HAPPEN AT ANY TIME with ANY DATA PROGRAM/SERVER.",
          "I recommend your any client or company to wait on switching over to PROCORE until the Internet Data Connection improves. As all NEW computer programs are being put out on the market for hire or purchase, all the kinks need to be fixed before one can say this is the best data program to use above all others out on the market. No time wasted, while you wait for this to actual be above the other products out there.",
          "PROCORE is being used for Construction Projects of various projects, from small fencing of a school site to a several High School Modernizations for Construction to installing scoreboards on a football field of a high school."
        ],
        "time": "October 16, 2018",
        "Product": "G2 CROWD",
        "SentimentScore": 0
      },
      {
        "name": "Andy M.",
        "title": "\"Good construction management software\"",
        "text": [
          "There are a lot of tools with the software that communicate with one another, so it makes record keeping and generation pretty streamlined. For example: RFIs linked to CEs linked to RFQs linked to commitments, etc.",
          "The plan upload and mark-up tools are still a bit clunky and there's no customization mark-up layers. And since plans are so integral to construction, it would be nice to see this tool with a little bit more functionality. Also, I don't think there's much about the Procore that is very intuitive. Most of the tools require a bit of training and usage to flow naturally, so the user experience could be better.",
          "Hardest part is getting subs to buy in to using the software. Be sure that you extended team is aware of the implementation and can be coaxed into using the program. This is where I think a better user experience would help. If Procore were more intuitive, it would help with the on-boarding.",
          "As I mentioned above, I think Procore really streamlines the record keeping and generation side of things. It's nice to be able to reference all these linked elements in one place."
        ],
        "time": "October 16, 2018",
        "Product": "G2 CROWD",
        "SentimentScore": -1
      },
      {
        "name": "tina w.",
        "title": "\"Organize your project in one place\"",
        "text": [
          "I love that Procore organizes all project information in one place. I don't have to worry about losing files if my computer crashes, or losing data if I forget to save.",
          "Procore has a few flaws that make simple tasks harder- like distributing. Distributing each line item because there is no bulk distribute is very frustrating. Plus, my subs don't like getting so many emails.",
          "Procore drive is also helpful because when using a PC, you may have duplicate folders in the same place or maybe you don't remember where you saved the document. I recommend using procore due to the fact that everything is in one place. The transition is a bit rough, but change is good! Push yourself and other employees to fully utilize Procore.",
          "We better able to track subcontractor's history in Procore. This keeps us updated on what they have uploaded or when they submitted documentation. This protects the GC in many situations when several attempts have been made to retrieve documentation."
        ],
        "time": "October 16, 2018",
        "Product": "G2 CROWD",
        "SentimentScore": 1
      },
      {
        "name": "Adam S.",
        "title": "\"Implementation of ProCore for a Sub Contractor\"",
        "text": [
          "We like that we can automate our daily log data collection gathering and get a report of our field teams and their hours in order to streamline payroll",
          "It is squarely focused on the General Contractor and is like fitting a square peg into a round hole trying to use it for a sub contractor",
          "There is still a lot of work to be done but they are headed in the right direction. There are a done of features but most of them are half-baked. Testing of the application needs to be more stringent before releasing patches and updates (which seem to be daily, which is a blessing and a curse).",
          "Field data collection gathering (daily logs, pictures)",
          "We have realized an easier way to gather field data on daily logs, and can pull the hours in the field to push into quickbooks in order to streamline payroll"
        ],
        "time": "October 16, 2018",
        "Product": "G2 CROWD",
        "SentimentScore": -1
      },
      {
        "name": "morris w.",
        "title": "\"Very easy to use, understand, and rationalizes work, but a bit expensive\"",
        "text": [
          "This software is very easy to use and learn. For those having difficulties in understanding the functioning of this software, online videos are available which are very precise and well organized to teach and train what you may require to know. Individuals at all levels are in a position to understand what they require. It is extremely easy to drag and upload functions and the process of creating user access templates and restricting access to specific areas of this software is straightforward. Procore has also developed a very easy policy to steer big project drawing books in a quick manner and also its ability to link with QuickBooks.",
          "Despite Procore being valuable, it is a bit expensive. Also, despite having online videos available for learning this software, some of its features are difficult to learn. For instance, the meeting tool can take a lot of practice to get used to. It is not as intuitive as the rest.",
          "I would highly recommend Procore to anyone who is still searching for a project management package. It works better the more you use it.",
          "Enhances clarity with employees and thus employees easily collaborates with the management of the company. We have enhanced communication between the site and the management which has made our project managers to obtain a better picture of their project without necessarily being present on the site."
        ],
        "time": "September 22, 2018",
        "Product": "G2 CROWD",
        "SentimentScore": 1
      },
      {
        "name": "Administrator in Sports",
        "title": "\"Procore is a great software program however it has a few bugs that need to be addressed\"",
        "text": [
          "What I like best about Procore is the ability to do everything from estimating to close outs all on one program. Customer service is always easy to use and I love the online chat option. Your representative are knowledgeable and always super kind, friendly and supportive. I always choose to chat online over calling your toll free number because the online chat representatives are way more knowledgeable than your phone call representatives. What I like best about Procore is the ability to do everything from estimating to close outs all on one program. Customer service is always easy to use and I love the online chat option. Your representative are knowledgeable and always super kind, friendly and supportive. I always choose to chat online over calling your toll free number because the online chat representatives are way more knowledgeable than your phone call representatives.What I like best about Procore is the ability to do everything from estimating to close outs all on one program. Customer service is always easy to use and I love the online chat option. Your representative are knowledgeable and always super kind, friendly and supportive. I always choose to chat online over calling your toll free number because the online chat representatives are way more knowledgeable than your phone call representatives.What I like best about Procore is the ability to do everything from estimating to close outs all on one program. Customer service is always easy to use and I love the online chat option. Your representative are knowledgeable and always super kind, friendly and supportive. I always choose to chat online over calling your toll free number because the online chat representatives are way more knowledgeable than your phone call representatives.",
          "What I dislike about Procore is the dashboard. It is not user friendly and their are some bugs that can be worked out and updated. Procore is a good platform and resource to our company and even though some things i dislike overall it is worth it. The search option is not enhanced and hard to narrow down searches. When using procore search it doesn't allow for multiple searches and will freeze up when u do so. What I dislike about Procore is the dashboard. It is not user friendly and their are some bugs that can be worked out and updated. Procore is a good platform and resource to our company and even though some things i dislike overall it is worth it. The search option is not enhanced and hard to narrow down searches. When using procore search it doesn't allow for multiple searches and will freeze up when u do so.",
          "Communication between General Contractors and Sub Contractors. The ability to use this program allows a constant stream of updates and better communication for all. We also have been able to streamline digitally the estimating process with all of our subcontractors nationwide and that is a huge asset. Communication between General Contractors and Sub Contractors. The ability to use this program allows a constant stream of updates and better communication for all. We also have been able to streamline digitally the estimating process with all of our subcontractors nationwide and that is a huge asset.",
          "Communication between General Contractors and Sub Contractors. The ability to use this program allows a constant stream of updates and better communication for all. We also have been able to streamline digitally the estimating process with all of our subcontractors nationwide and that is a huge asset. Communication between General Contractors and Sub Contractors. The ability to use this program allows a constant stream of updates and better communication for all. We also have been able to streamline digitally the estimating process with all of our subcontractors nationwide and that is a huge asset."
        ],
        "time": "September 20, 2018",
        "Product": "G2 CROWD",
        "SentimentScore": 1
      },
      {
        "name": "Michael P.",
        "title": "\"Smart tool for each level of project interaction. \"",
        "text": [
          "Documentation tracking and document control is easy to use and protects us in today's climate. The cost control reports are also useful and better than the competition.",
          "Contact database management is static and non-editable. This leads to redundant entries for different end users. Also, the interface with accounting is not seamless.",
          "It's a great product that is easy to use at most levels of the company, from field super to executive. We have also received positive feedback form partners and clients.",
          "Document control and record keeping are so critical in the industry today. Also the dashboard allows for efficient review of project status, form both schedule and revenue standpoints."
        ],
        "time": "October 19, 2018",
        "Product": "G2 CROWD",
        "SentimentScore": -1
      },
      {
        "name": "Denise L.",
        "title": "\"Great \"",
        "text": [
          "Everything is very intuitive, great training and help section for when you do have to figure things out. Support is top notch.",
          "Would like some flexibility in what office vs field can see with cost codes ... but you can always Post and Idea and see what others are asking for ... ProCore does make changes",
          "Tracking - easy to track status of everything, keep track of everything - who has what, where do you have to follow up. Getting information back from the field is instant, no longer waiting for the guys to bring in paperwork."
        ],
        "time": "March 20, 2019",
        "Product": "G2 CROWD",
        "SentimentScore": -1
      },
      {
        "name": "Juan V.",
        "title": "\"User Friendly & Virtual Assistant\"",
        "text": [
          "ProCore is dummy proof and easy to use. We love that every aspect of the project can be organized in one place. ProCore makes communication with the general contractor easy.",
          "Not so much ProCore, but we have found that the GCs are not properly trained on how to use ProCore properly, so many times we do not get the project information when we need it.",
          "You won't be sorry. If you are looking for a program, easy to use and affordable, Procore is it. We are able to log in to Procore and make sure that we have stayed on schedule, and that we have our submittals/ drawings ready to be approved and reviewed.",
          "Benefits: schedules, communication, submittals, billing, and change orders are all in one place; almost like a virtual assistant."
        ],
        "time": "December 22, 2017",
        "Product": "G2 CROWD",
        "SentimentScore": 1
      },
      {
        "name": "Wes S.",
        "title": "\"Manage projects from anywhere and keep your team connected\"",
        "text": [
          "I love the fact that Procore provides a place for all of our project documentation to reside. Our project teams have constant access to everything on their projects from anywhere with an internet connection. Plus, Procore allows unlimited users and storage, so no worrying about keeping up with licenses and seats.",
          "The only negative is price. The system is expensive, but it is worth it. You would have to hire multiple employees to keep up with what Procore does.",
          "If your company is using Sage for accounting, get the ERP integration with Procore! This allows you to write PO's and track your job costs through the system.",
          "We are eliminating data silos and communication breakdowns. We have already seen the system pay for itself this year, and we expect it to do the same next year."
        ],
        "time": "November 8, 2017",
        "Product": "G2 CROWD",
        "SentimentScore": 0
      },
      {
        "name": "User",
        "title": "\"Easily managed and visualized construction workflow.\"",
        "text": [
          "Simplicity of options, workflow is visualized nicely, it's easy to reference between drawings and construction questions by clicking clouded/linked documents. I really like the opportunity to be able to respond to RFIs and submittals in the field via an email response (not having to log into a website or application to respond to pressing questions) is awesome. It's also great to be able to see which drawings every team member is using via the same application that is also referencing construction questions and responses. Being able to open a slab edge plan and see the associated questions via tagged clouds in real time is incredible and really helps the team.",
          "Email settings not easy to change.. I receive way too many emails every time someone responds to a question or workflow that I am tasked with. I also dislike the sometimes too simplified interface- there should be more in-depth tools for those people who are using it to create many of the drawings.",
          "We recommend it from the architecture side of the service!",
          "My team is using it from the architect's side of the workflow issue. We respond to RFIs/submittals/drawing changes through this service. We realize the efficiency of keeping all documents in one application, and it's extremely helpful to use the same tool that all contractors and subcontractors and design team members are using."
        ],
        "time": "July 30, 2018",
        "Product": "G2 CROWD",
        "SentimentScore": 1
      },
      {
        "name": "Joel B.",
        "title": "\"My Procore review\"",
        "text": [
          "The dash board layout is great. Information or questions are sent simultaneously to all originally established parties. It keeps records of days pending between sent outs and responds. Software allows to keep archive, treat multiple project from one base.",
          "Again the dashboard is nice but not so obvious to navigate through. Finding where to click to be able to write an answer not direct. Once you have addressed a communication it goes back to main dashboard instead of sub dashboard you working from.",
          "get a demonstration of the use and functionality to make sure it suits before adopting it. Once you setup all your projects on it, it is difficult to switch while on course.",
          "Keeping records of info, communications of all parties. Easy to communicate with the group. The main benefit is n lost communication, record of date and time. When schedule is priority on a project, timing of questions and answers is critical, this software comes as great tool."
        ],
        "time": "July 27, 2018",
        "Product": "G2 CROWD",
        "SentimentScore": 0
      },
      {
        "name": "Joseph S.",
        "title": "\"Over I see it as a great platform to organize business. \"",
        "text": [
          "I would have to say the easy navigation features would have to be what I like the most. I love the fact that I have a plethora of jod specific information at my fingertips. Oh and the touch was a awesome added feature.",
          "The only negative I find is the speed at which it takes to upload photos to the app. Other then that I can't really complain about anything else.",
          "I have actually shared procore on multiple occasions to help friends of mine with there small business",
          "So with our line of work we have multiple crew working different job sites everyday. It helps to up on the progress of a job when it can't be completed in a day. Especially when different crews are going to a job that was already started."
        ],
        "time": "November 7, 2017",
        "Product": "G2 CROWD",
        "SentimentScore": -1
      },
      {
        "name": "Russ M.",
        "title": "\"Procore Commercial General Contractor's Review\"",
        "text": [
          "Our favorite feature of Procore is the constant improvements to their product. The ability to suggest ideas about the way the software works and to see them come to light puts Procore way ahead of the competition.",
          "There isn't much to dislike. The ability to use the submittal tool as log only bypassing review cycles would be our only comment.",
          "Procore improves job efficiency by helping our employees do the same job they did 10 years ago twice as fast. Viewing drawings while walking around on-site, tracking punch lists via mobile app are just one of the many ways Procore has helped us."
        ],
        "time": "October 16, 2018",
        "Product": "G2 CROWD",
        "SentimentScore": -1
      },
      {
        "name": "Angelique H.",
        "title": "\"Hands Down the BEST Overall Construction Software\"",
        "text": [
          "Ease of uploads",
          "Unique Email addresses for each folder in document module- no more downloading attachments from an email and uploading into Procore- Just simply send an email to the unique folder email address and viola! filed! there are so so many rad features to this software, too many to name!",
          "very very little, let me tell you.",
          "ok- here is 1-",
          "Lets say im creating a contract- if the project directory isnt complete, and i need to add the vendor or sub- when i click to do this, it should open in a new tab/screen or remember the data ive entered into the contract fields to alleviate re-entering data.",
          "DO ITTTTTTTTT!",
          "COLLABORATION between field & office! Documents in real time, sharing in real time, the latest versions at hand."
        ],
        "time": "November 21, 2017",
        "Product": "G2 CROWD",
        "SentimentScore": 0
      },
      {
        "name": "Spencer D.",
        "title": "Procore Year End Review",
        "text": [
          "Comments: Emails generated by Procore seem to get ignored more often than not and I believe this is due to their generic nature. For instance, if I am a subcontractor sitting at my computer and I get a Procore notification (or dozens), I don't know if its a submittal request, an invitation to bid, or an update to the drawings. And if i'm getting dozens of these notifications each day, it becomes difficult to prioritize. I've noticed that subcontractors are much more willing to respond to a personal email than to a Procore email. It would be helpful if a Procore notification could more closely resemble a regular email. Who it's from, the subject, short and sweet.",
          "Pros: Procore's construction management tools are both easy to use and functional. Some of the best features that come to mind are the Drawing tool's ability to keep track of current drawings while still being able to review superseded drawings, the Submittal tool's ability to assign submittals to subcontractors so that they know exactly what is required and when it is expected by, and the Punchlist tool's ability to simplify the tracking process and even pinpoint each item to a specific location on the drawings.",
          "Cons: All construction companies have a different way of doing things but Procore, in a way, forces everything to be done a certain way. If you try and tweak things to mimic your company's way of doing things, it may break some of the automated functionality within the software which may cause a lack of continuity and create the potential for user error. Also, some of the tools could use some major improvements. The Drawing tool's markup options are great but they are inconsistent. For instance, when adding text, the only way to change the font size is with a slider bar which makes it difficult to keep things consistent. Also, would it be possible to get a copy and paste feature? The Directory tool is great at keeping companies and users organized and it would be incredibly helpful for companies to add some custom features. For instance, my company likes to track how many employees a company might have, and the states that they are willing to work but there isn't a good way of noting this."
        ],
        "time": "Dec 27, 2018",
        "Product": "CAPTERRA",
        "SentimentScore": -1
      },
      {
        "name": "Paul B.",
        "title": "Comprehensive Project Management System",
        "text": [
          "Comments: I have worked in residential home construction, single & multifamily construction, multifamily affordable housing, mixed use, and commercial construction projects. I have worked on projects ranging from less than 1K to over 16M. Procore is outstanding for all but small single-family residential projects...I could make Procore work like a charm for this type of construction, but it would take some creativity.",
          "Pros: Daily Logs are easily completed and sent to the appropriate parties. This means they actually get done which means they are more accurate. Adding photos to the logs is very easy as well. Procore allows you to put links to photos on your drawing set. This is especially helpful when we send out bid packages...bidders can see more details and existing conditions for our commercial remodeling projects. If you need to send out a lot of requests for quotes, Procore makes it easy to keep track of everything through the Reports function. PM's can also drill down to see who has or has not opened the invitation...a real time saver! Procore has a submittal builder built in, so after you upload the spec book, you can click on the builder and it generates a list of possible submittals. You can modify the list to suit your need. This can save days on a large project. When you upload revised drawing pages, Procore allows you to overlay the pages and highlights the differences with the new set. This is very helpful even if you were aware of the coming changes. It also allows you the chance to note the changes for possible change orders.",
          "Cons: I'd like to see the ability to more with the mark-up tool. Features that are available on simple take-off software would be nice. Something as simple as being able to place a color-coded dot would be helpful. When adding people to the directory, it would be nice if when you forget to complete one of the required fields and hit SAVE...rather than delete everything because you forgot that one step...it'd be nice to just give you a message asking you to \"please enter missing information\". The way is now, seems rather punitive, but I'm sure they will change it. I'd like to see other types of scheduling options become compatible with Procore. I do use MS Project, but not everyone does. Project is rather pricey and would be another software product to learn."
        ],
        "time": "Dec 19, 2018",
        "Product": "CAPTERRA",
        "SentimentScore": 1
      },
      {
        "name": "Verified Reviewer",
        "title": "I am a construction project manager for a multi-family construction general contractor.",
        "text": [
          "Pros: I have used the software previously as a subcontractor and now working for a general contractor. Procore keeps all necessary construction documentation in one, easy to access place with no space restrictions. It can be utilized offline for those out of the way projects. Once the system is understood and practiced, it is quite useful. Sometimes my office is 500+ miles away from the jobsite. I can be on the phone with my superintendent, looking at the same documents while on the phone discussing the issue. Submittals and RFI can be turned around in a day (if all team members are paying attention and on board with Procore.) I can have owners included on the system with limited access to photos and reports. Everyone in our office uses Procore; project managers, coordinators, AP, AR, and directors. I remember how we used to do everything with hard copies and ship back and forth between team members. Procore speeds up the process and streamlines everything.\n\nI also had to sit through depositions for a project that went wrong, 6 years after the project was completed. All of the evidence was either printed emails, or hard copies of daily reports, pictures, etc. I feel like I would have been better covered and better represented if I had all of my documents organized within the system and structure of Procore.",
          "Cons: While Procore is a great system, it is a complicated system and takes some time and training to adopt and master. Like any other program, Procore can only be as good as the data and information uploaded. I find it most difficult to get architects and engineers on board initially. Once on board, most of them question why they were so reluctant, but it is almost always a process. Subcontractors are very similar, although many of our subcontractors still fax over using email.",
          "Overall: It saves time, collects a ton of data into one place, and there are no limits on size."
        ],
        "time": "Jan 31, 2018",
        "Product": "CAPTERRA",
        "SentimentScore": -1
      },
      {
        "name": "Brian H.",
        "title": "Procore saved us from cobbled together Excel spreadsheets and poorly implemented SharePoint sites",
        "text": [
          "Pros: As an Agile-led development team, Procore is constantly improving their product through extensive analytics and actual customer feedback. This is a process I've witnessed first hand. In terms of the product, Procore integrates all the key tools needed for managing projects in the built environment. In addition, the product helps reinforce best practices in construction project management, which coming from a forensic expert, that's definitely a good thing when it comes to proactively managing risk. If more companies simply relied on tools like Procore for managing their projects, there would be a measurable decrease in claims, disputes and litigation.",
          "Cons: Despite extensive multimedia training materials, Procore remains a very difficult tool for onboarding new employees. In addition, the Procore marketing materials didn't set proper expectations for the overhead required to implement Procore company-wide. Additionally, Procore has made the decision to really focus their tools and the language used for describing those tools on very specific roles - primarily general contractors, at-risk CMs with trade contractors and engineers occupying the second tier or class of clients. For agency CMs, architects, other consultants, etc., use of the product is somewhat different from how the documentation describes it.",
          "Overall: Better clarity into the activities, documentation and critical information associated with our project, which number in the hundreds. Procore allows us to easily collaborate with our employees, outside members, other consultants, our clients, etc. Perhaps most importantly, Procore enables us to better serve our clients by keeping critical project information together in a trusted system. It has even enabled us to compete with much larger firms by showcasing the quality of work product produced from within Procore."
        ],
        "time": "May 26, 2017",
        "Product": "CAPTERRA",
        "SentimentScore": -1
      },
      {
        "name": "Patricia C.",
        "title": "Great Project Collaboration Tool!",
        "text": [
          "Comments: Procore is extremely easy to use and learn. The online training videos are brief and well organized to teach what you need to know. We were able to very quickly ramp up our project and start using Procore for our project team and found most of our subcontractors were also interested in seeing Procore in action. Any interactions I have had with customer support or their designers has always been extremely helpful. It's always great to get a call request from the designers related to a suggested change that you put in wanting to make sure that what they are looking to do will meet your expectations or at least how they can better meet your expectations. I love signing into Procore and having the popups telling me what new changes they have implemented overnight, shows they are always growing and improving their product to better meet the needs of their clients.",
          "Pros: Very easy to use and set up the preferences. Document uploads are simple drag and drop functions in most areas. Creating user access templates and controlling or restricting access to certain areas of the platform is very easy. Individuals at all levels throughout the process are fairly easily able to understand what they need to do as it is very intuitive.",
          "Cons: The user access setting need to be customizable at a lower level of detail, I would have rated five stars for Features & Functionality if it weren't for this. I find myself having to give people within the group full Administrative rights to tools in order for them to do what should be a task available at a lower level without full rights to change setup of the tool. If you aren't doing the same or extremely similar projects each and every time, there needs to be a Corporate level for reporting purposes and what they now have as \"Company\" level would be more the project level for those projects that are almost identical and/or being performed by the same project group. Changes made to the company level affect all the projects underneath that company and many settings are only at the Company level so if your projects aren't VERY similar to each other this may not work out well. In our case, Procore has managed a work around for this but it causes many of the executive dashboard functions to not work right. Limited customization but with a little ingenuity you can figure out ways to make things work.",
          "Recommendations to other buyers: Pay close attention to your setup, think about if you will have (or might have) more than one project under your company because you will want to set up many items at the Project level instead of Company level. Procore is a great product and I highly recommend it as a very easy to use tool for controlling project documentation."
        ],
        "time": "Feb 14, 2017",
        "Product": "CAPTERRA",
        "SentimentScore": -1
      },
      {
        "name": "Josh M.",
        "title": "Great Program Overall; however, a few features and processes that need fixing",
        "text": [
          "Comments: Procore overall is an excellent program. Their cloud-based platform works really well for compiling large amounts of data among many users. Store and share essentially unlimited job-site photos. Upload the project drawings and enable great team collaboration with their drawing editing tools; such as, linking RFIs to a section of the drawing, or highlighting a specific detail to ask the team about later. In project management software, the inclusion of a functional mobile app is crucial and Procore nails it fairly well. For our construction management use, we are pleased with the auto-reminder feature in-which the person responsible for approving RFIs, Submittals, ect.. will receive daily reminders to complete their over-due tasks. The tool is also highly advanced in setting specific permissions per user - maybe you don't want your subcontractor to view all of the project data - Procore makes this easy.",
          "Pros: > Unlimited storage for your project photos, documents, drawings, etc... > Easy to use, free mobile app (Android & iOS) > Everything is archived and stored in an organized manner, it's like having your entire project in a cloud-based filing cabinet > The project / company directory tool is really great and well organized, you can also easily download a contact's business card for upload into Microsoft Outlook > The daily log tool is excellent for the superintendent to record all day-to-day activities on the job-site. A report can be produced looking at all daily logs throughout the project. A great asset to have in the occurrence of a dispute.",
          "Cons: > The built-in scheduling tool is cumbersome and sub-par. It's better just to run project scheduling out of different software all-together (I.E. Microsoft Project or Primavera). However, Procore does allow for you to upload your MS Project or Primavera files, this is very handy. > You cannot create sub-folders within the Photos tool. Just one folder per location / subject to store all of the photos in. We would find it useful to have sub folders, such as: Folder 1 = Pre-Construction Photos, Folder 2 = Building A, Folder 3 = Unit 101 ... ect... > Once an RFI is created and sent, it cannot be edited. there are many instances in which we need to modify RFIs after they've been sent, sometimes the client even requests it from us. > It'd be great if the Photos tool on the mobile app allowed for users to take pictures using the cell phone's volume buttons",
          "Recommendations to other buyers: Honestly, I have put a ton of time into Project Management software research. Procore is definitely one of the best on the market, reasonably priced too. Some other good software to compare it to would be \"Jonas Enterprise\", \"Builder Trend\", \"ProLog\", \"Aconex\", \"PlanGrid\", \"AutoDesk's Constructware\", \"PM Web\", & \"Brick Control\". If you do decide to go with Procore, ensure that you really take the time to properly set-up and customize it for your companies needs. Properly setting Procore up is a bit time consuming, but their customer support is great at guiding you through the process. Also, you will want to assign a tech savvy person the role of Procore administrator in which they can manage all of your projects in Procore from behind the scenes. Lastly, you will want to have strong and effective training sessions with your employees... we are still struggling with this... not all employees know how to use the program to its full capacity and we simply just need to train them a bit more."
        ],
        "time": "Dec 08, 2016",
        "Product": "CAPTERRA",
        "SentimentScore": 1
      },
      {
        "name": "Dani B.",
        "title": "Just one of the many project management software available",
        "text": [
          "Comments: First let me start by saying that I've used Sage CRE 300 project management, Submittal Exchange, and Newforma Project Cloud. They each have their benefits. I pushed for Procore because it was an all inclusive product. We use one of the other programs as well as eNTERFACE (for Daily Reports), PlanGrid (for drawings), ShareFile (for sharing documents), Outlook, AIA Contract Documents, DocuSign (for e-signatures) and a handful of others just to manage a job. I was tired of bouncing around between programs, often duplicating file storage or data entry. I spent months researching the available project management options that would also be available from essentially anywhere...job site, office, home, etc. I have been using Procore for about six months and there are things that I love and things I don't love. I would still recommend the product, if you need an all-in-one solution. I will try to highlight my more important Pros and Cons. When I say \"Module\" I really mean tab. There's a tab for the directory, documents, drawings, submittals, RFIs, emails, etc. I consider each one a separate module because they could really function on their own.",
          "Pros: 1. Comprehensive package. Allows for integration with out accounting, but we haven't opted to go that route yet. Can eliminate many of the other programs we use, but not all. 2. Can limit user access, so I can give everyone access to just what they need. 3. Lots of online training available and assistance from the very start. 4. Fairly easy to use once you know what you are doing. 5. Accessible from any internet-accessible device. 6. Constantly talking about improvement. I haven't been through a major upgrade yet, but they seem to take into account what the contractor needs.",
          "Cons: 1. Modules aren't consistent. For example, submittals allow me to edit on behalf of someone. RFIs do not. I've seen this in other products where one tab or module works one way and the other tab is set up different. I expected more consistency between the modules, submittals and RFIs especially. 2. No separate module for ASIs. They can be linked to drawings and markups, but there's no ASI log that people can view. I can save the ASIs in a folder in the online documents, but the user has to go search for them. I can send email notices out to subs, but if a new sub comes on board, they will not have the emails. 3. I cannot scroll through RFIs easily. In Sage I can move easily from one RFI to the next if I'm searching for something particular. In Procore, I have to open an RFI, close it and go back to the log and open the next RFI. One of the things I wanted to do was cut down on the number of steps it took to get to the data I needed. Procore adds steps in this case. Same for Submittals. I have to open/close/open the next. 4. The Save or Close buttons are often way down at the bottom of a window. If I have to go in, enter just a few pieces of info at the top of the submittal or RFI, I then have to scroll all the way to the bottom. Some companies put a Save at the top and bottom for that reason. 5. Was told I could use my iPad/iPhone but the apps are only for information. I cannot add to the contacts/directory unless I login through Safari. 6. So much data on the screen that sometimes the key pieces I need are off the screen. Needs more work on setting up for various screen resolutions. For example, submittal titles and numbers aren't visible when I'm scrolling to the right. Needs something similar to Excel's Freeze function. 7. Email module doesn't work quite like I had hoped. I can drag emails into the online program, but it's difficult to search and view them. Some of the text gets jumbled with the date. They don't even have the Emails on the iPad/iPhone app. No way to sort them other than to tag them, which is difficult. If I copy a ton of emails over, then I have to tag each one manually. Not an efficient process yet. 8. Not easy to bulk edit. Procore had to upload our submittal log for us and then I needed to change a lot of it because it was our first upload. We had to manually open each submittal and edit the information I needed to add or change. 9. Data itself seems difficult to change like contacts, which cannot be deleted, even if you've never used them. Can only mark inactive. Benefit in some cases, but if you enter their email address wrong, it's there unless you contact them to delete it. I would love to be able to do more import/exporting on my own. It would make data entry a lot easier. Especially when setting up a job or entering commitments.",
          "Recommendations to other buyers: The investment is huge. If you are looking for a complete project management package, this will do it, but be prepared to completely immerse yourself in Procore. I do not recommend using it for one or two jobs. The more you use it, the better it will work for you."
        ],
        "time": "Nov 07, 2016",
        "Product": "CAPTERRA",
        "SentimentScore": 1
      },
      {
        "name": "Brynne D.",
        "title": "Procore - Great Software Program for General Contractors",
        "text": [
          "Pros: There are numerous things I like about Procore. What I like best about Procore would be that it is a great organizational tool. It helps streamline every day tasks, whether it be sending submittals to be approved or simply keeping track of time spent on site. The fact that it helps so much with time management (which is key for project planning) is a crucial aspect of the software which makes me really enjoy it. It makes life easier by keeping record of just about every aspect of a project. It's extremely helpful that Procore keeps track of emails for you in regards to things like submittals. This makes it so there is no confusion about whether or not an email was actually sent or received. The software also allows construction documents to get approved in a more time efficient manner. I love that the architect, or whomever is the approver, can do so online via a credible software instead of just word of mouth, or in an email. It is much more legitimate. In terms of the vendor, they have been great. Their customer service is outstanding. They are readily available to help no matter what time of day it is - which is wonderful. They also provide many tutorials and seminars to help get a deeper understanding of the software and all that it does. Every time I have contacted customer service they have been quick and to the point. I really appreciate this because when I am at work, my time is even more valuable and I have a sense of urgency with everything I do. Being in the construction industry there are always crucial deadlines that are important to make. I don't have time to sit and chat with customer service for hours as they ask me annoying protocol questions that jump around the initial question that I have. So Procore has really been great with that.",
          "Cons: Some of the layout is bothersome. For example, the project directory. The project directory would be better for close out documents if it was organized in a different way. I would love to see procore organize it by division. The software is also rather costly. It is a big expense, though I have found it to be worthwhile.",
          "Recommendations to other buyers: Think about whether or not it is cost effective for your business and if it would streamline your company's work load."
        ],
        "time": "Aug 01, 2016",
        "Product": "CAPTERRA",
        "SentimentScore": 1
      },
      {
        "name": "Ruth M.",
        "title": "Excellent full-on project management software",
        "text": [
          "Comments: This is a package aimed at construction professionals and provides a thorough means of managing multiple projects across multiple people and teams including architects, designers, and subcontractors. It is a significant investment not a simple free app, and needs to be approached as such. The implementation is pretty straightforward and the customer support excellent.here remain some annoying features, but the support team are responsive and it is clear that significant investment if still being made into improving the software.",
          "Pros: Much better than the competition at managing a range of projects across the things you need in construction - RFI,s , punch/snag list (we use this for internal \"to do\" items) and critically the main contract variations- this is a bit clunky but REALLY effective when you get the hang of it - meetings recording is again a trifle clunky but very effective so I forgive it For the first time in 15 years I have proper oversight across all projects (typically around 40-60) and can manage the progress of each from my iPad wherever I am. Site logging app very powerful Clients love the visibility Document handling with version control is brilliant",
          "Cons: The only really annoying feature is that the company level information (ie visibility across projects, personal \"open items\" lists and financials) is only available on the browser version not the app. The directory and permissions systems are well intentioned but actually you have to subvert them a bit as to do anything useful people really need full admin rights (even to add a contact to a directory- if this is to be used as the main shared company contacts directory we need everyone to be able to do that). I am happy to give my people that, but I can imagine a lot of companies where you don't want all your staff to have access to budgets and financials. It is expensive- we think it a great investment at this time, but it is nonetheless expensive. if you are looking for a cheap app this is not the one for you. The us-centric language and set up is a minor irritation- the partial attempt at making it Anglophile (changing a few of the function names) is actually worse than useless as the changes just confuse people- the training videos refer to the US terms for things and you can get used to pretty fast, but then they are not called that on your screen. I would love to be able to customise some of the standard PDF outputs Drawings handling a bit clunky, particularly markups- brilliant idea and conception but difficult to use as you can't undo markups once you have done them which makes people risk averse in case they cock it up- I am confident this will improve"
        ],
        "time": "Apr 06, 2016",
        "Product": "CAPTERRA",
        "SentimentScore": -1
      },
      {
        "name": "Alex H.",
        "title": "Procore Review 04/07/2015",
        "text": [
          "Pros: Field coordination when your firm isn't on the levels of remote servers. Our site trailers don't have access to our server aside from a cruddy desktop remote log in. A good number of our sites we've only got a super with a laptop, maybe even just a cellphone or tablet on the tiny ones. This allows us to do our documentation in the office and we have all those records in proper order and a single place when out in the field. No more dependence on supers to create their own folder structure for that documentation. The vendor is usually pretty attentive and able to assist.",
          "Cons: Product is still being built. It is a huge tool that is always expanding. Has more than you think you need sometimes, but sometimes you find something you need and it cannot help you with. Drawing tool can't support multiple sets (e.g. multiple building projects), Documents tool doesn't have the markups you see in other tools within Procore (like drawings), many things with the bidding tool, etc. Least favorite about the vendor is when they've so many things on the road map, it's impossible to know exactly when, or if, some features will be implemented. Whether they are very simple, or complex. Getting increasingly harder to submit ideas for improvement as well. Seems to have changed from the post idea and vote ideas system. Or maybe something was just rearranged in a less clear manner.",
          "Recommendations to other buyers: Determine everything you are looking to get out of this. Do you have a centralized company directory? How does your field staff obtain and maintain the documentation you give them? Do you have a way to allow your subs to retrieve theirs and other submittals, RFIs, drawings, or other items on their own accord? Do you want that? Do you (or your architect) want to avoid the current punchlist process of them writing notes, marking up a floor plan, going back to their office, typing it, sending it, you re-typing it into your own form, attaching your own picture, then resending to your subs? Seriously watch videos on the punchlist tool, especially with regard to iPad/Tablet use. Do you have lazy supers that cannot send out a basic email daily log, and do you want to give them a 30 second approach via cellphone app?"
        ],
        "time": "Apr 07, 2015",
        "Product": "CAPTERRA",
        "SentimentScore": -1
      },
      {
        "name": "Skyler S.",
        "title": "Powerful tool in the palm of your hand",
        "text": [
          "Comments: The most powerful parts of the software are accessible on the mobile apps. Using mobile apps to populate Daily Logs as you go and access critical documents or make redlines is a huge time saver for the Field Staff. Where before they would take hand notes and spend time (sometimes hours) at the end or start of each shift, inputting the info collected from the previous shift; now they do that work as they go with little to no disruption to the flow of their day. Gaining back this lost time provides a better work-life balance for Field Staff and more accurate and timely reporting for Project Teams to rely on.",
          "Pros: Features of other mobile construction management software all rolled into one. Replaces Timberline, BlueBeam, Doc-u-Sign, excel spreadsheets, and file sharing services like box... but if you like the features of some of those programs, it also links to them with modules. So now your document control between cloud based services like Egnyte and ProCore's document folders can be linked so that documents appear and are accessible/editable, from both platforms and double duty of making two systems match is eliminated.",
          "Cons: I honestly can't find a con with this program... sometimes the level of access you have to make changes that require admin level access are not accessible on the mobile app versions of the software. I wish I could add to drop down lists on the fly without having to go to the web-based version of the software."
        ],
        "time": "Feb 25, 2019",
        "Product": "CAPTERRA",
        "SentimentScore": 0
      },
      {
        "name": "Heather T.",
        "title": "ProCore has revolutionized our ability to manage projects across the United States.",
        "text": [
          "Comments: I am not sure if this is taking place yet, but universities and trade schools that offer construction management degrees and certifications should absolutely be introducing project management software as part of the curriculum.",
          "Pros: Cloud-based. Great customer support. Willing to do the work and research it takes to develop the tools needed in the field.",
          "Cons: There is soooo much to learn. There is a rather long learning curve, if you've never used programs like this. The thing that would be most helpful to me is if there were not just a video, but an interactive tutorial for the tools procore offers. It would be much easier to learn them if we had to \"practice\" using them without the risk of screwing up our project or making a bunch of entries that we have to back out because we did it wrong. That is what keeps most of us from utilitizing ProCore to it's full potential. It would also be awesome if we could EASILY see who can see the information being input in to ProCore. I know we set up permissions, but if you have more than a couple of Admins, like we do, those permissions might get changed. It would be nice if we could click on the \"configurations\" or \"settings\" in a certain tab and just see a list of people that have access to the tab. Last thing... dammit, we need to be able to set up meeting templates. Our basic template for Owner/Architect meetings, Project Kick off Meeting, and weekly sub meetings NEVER CHANGES. We need meeting templates that can be set up at the company level and added to each project, just like inspections."
        ],
        "time": "Mar 24, 2017",
        "Product": "CAPTERRA",
        "SentimentScore": -1
      },
      {
        "name": "Verified Reviewer",
        "title": "Hub of Information",
        "text": [
          "Comments: Procore allows all levels of production to access information in one place. Our AP people can also access certain information. We can also set permissions for our Architects/Engineers, subcontractors, and third party inspectors to view project plans, specifications, documents, pictures, reports, and schedules.",
          "Pros: Everything can be in one place. The ease of access to files, and large files, is great and increases our productivity. The apps for my phone and ipad help me to access plans on walk-throughs without packing the entire set of plans. My field personnel can upload pictures and daily reports that I can access at any time to answer questions from our executives. With my laptop I can access anything in the system as an admin.",
          "Cons: The size of the app on my ipad and iphone is huge. The worst problem I have is with subcontractors setting up their own profile and learning to navigate the system. Once subcontractors learn what is possible and how little effort is involved, they typically love it, but getting over that hump is difficult.",
          "Recommendations to other buyers: This system, like others, is only as good as the information that is entered. Be concise with your entries, and your life will be easier at the later date when you need that information. Train your subcontractors on use of Procore. I use their ability to utilize Procore as a factor in my awarding decisions. If a sub is not willing to learn Procore, how willing will they be to learn the specifications, plans, insurance requirements, and safety procedures? The lowest bidder may end up consuming all of the budgeted overhead with their unwillingness to cooperate, creating the overall lowest value."
        ],
        "time": "Aug 01, 2016",
        "Product": "CAPTERRA",
        "SentimentScore": 1
      },
      {
        "name": "Pamela G.",
        "title": "Intuitive and Powerful !",
        "text": [
          "Comments: We have been using Procore for over two years, to manage small renovation projects for multiple university projects. We typically have 30 active projects running concurrently, in all phases of construction. With multiple clients (departments), designers, subcontractors, and vendors, it was important to have a construction information management system that was easy to learn and use for many people, without having to pay a seat license for each user. We don't use all of the modules, but the drawing management, submittal, and RFI modules are real time savers. We have also found that Procore makes it very easy to extract and archive project data upon completion of a job.",
          "Pros: Very intuitive interface, plus exceptional tech support via \"chat.\" Very good mobile app allows the architect to answer RFIs right from a cell phone, as easy as responding to an email. This helps gets questions answered quickly. Also, easy to keep up to speed on multiple projects concurrently with dashboards. The automatic e-mail reminders on overdue items help keep the entire team on track.",
          "Cons: The meeting minutes tool is not as intuitive as the rest of the modules, and takes a bit of practice to get used to. Very good documentation once you get through the learning curve.",
          "Recommendations to other buyers: I have had the opportunity to work with several computerized construction information management systems through the years -- Procore is deceptively easy to use for the amount of power-information it can handle."
        ],
        "time": "Feb 16, 2017",
        "Product": "CAPTERRA",
        "SentimentScore": -1
      },
      {
        "name": "Nivek C.",
        "title": "Robust Construction Project Management Platform",
        "text": [
          "Pros: Its incredibly robust and packed with features that general contractors absolutely need, along with features that some may have never thought of utilizing. If your organization is looking to expand and go digital, while still maintaining a grip on your assets, employees, and projects, then you need to look into Procore.",
          "Cons: Not necessarily a con, just an uncontrollable inconvenience. There are companies that are large and very successful who can afford Procore and there are companies who are smaller and can not afford Procore. Also, customer service in my opinion is good, but could be much better. It seems that they expanded very quickly and are trying organize a suitable customer service system. Again, not a bad thing, but it can definitely be better.",
          "Overall: After reviewing and using the trial, I was incredibly impressed with the features that Procore has to offer. In my opinion, Procore would be an incredible asset to large general contractors. The features and detail they have put into this software is intuitive, functional, and accurate. Because it was built for large organizations, the pricing and features may not be a good fit for small contractors and sub-contractors. I was informed that Procore has released a sub-contractors version of their flagship software, but upon my trial, it seemed like it was just the same platform with certain features eliminated. As of right now, until Procore really puts some research and development into small contractors and sub-contractors needs in this arena, I don't think the price justifies the features that are currently in the software.",
          "There's no doubt that Procore dominates the construction management software arena if your company is large enough to afford the price point. For small contractors looking for software similar to Procore in regards to features, functionality, and ease-of-use, I suggest looking into SiteMax.",
          "Recommendations to other buyers: Procore is great! The features are incredible and it does exactly what a contractor needs it to do. Procore also seems to be putting a lot of research and development into expanding their features and utilizing different and innovative systems to enhance their software. I would suggest really doing some market research regarding smaller contractors and sub-contractors. If Procore could sell to both large contractors and small contractors and sub-contractors, they would dominate the construction industry... especially if the different levels of contractors could function together within the same Procore system."
        ],
        "time": "Nov 07, 2016",
        "Product": "CAPTERRA",
        "SentimentScore": 1
      },
      {
        "name": "Justin P.",
        "title": "Procore construction software simplifies management",
        "text": [
          "Comments: We signed up with Procore late 2016 in order to simplify the management of a large school project we were about to undertake. Well since then we have added other projects into the system and learned quite a lot and found many useful functions of the Procore system. Our office starts uploads the job files and drawings, our site managers and supervisors and sees what's going on, work on the schedule, check and mark up drawings if needed including making RFI's on site and dealing with them then and there. Everyone involved within the project can see what's happening and be informed of the progress, issues can be raised and dealt with quickly and efficiently and we can also carry out site inspections and record meeting notes within procure. Our office managers can follow budget tracking for a particular project, check costs and any variations, look at what cost variations relate to and how they impact the overall job. It basically takes all the smaller tools and a variety of different methods and integrates them into one package that's easy for everyone to use. Even our clients have a simple way to see what's going on with the project and photos of the progress.",
          "Pros: It's easy to use (even for our not so technically minded staff) and the information can be accessed virtually anywhere with office staff entering information via the web and site managers through the iPad app. One of the biggest features is the control of drawings and document management, this ensures our site managers always have the latest information, avoids any confusion and streamlines any markups and RFI's.",
          "Cons: Whilst the iPad app is good I believe it can be a lot better. We use Ipad Pro devices and there is a lot of screen real estate that can be taken advantage of with this app. We look forward to a revised iPad pro app that fully takes advantage of the system.",
          "Recommendations to other buyers: Have a look around at the available software options, I don't believe there is a comprehensive option available for the construction industry to use that is a featured and portable as Procore. When evaluating the cost I would take into account all the various tools and features of the system and the overall saving (time, management, risk etc) it would represent to your company."
        ],
        "time": "Feb 02, 2017",
        "Product": "CAPTERRA",
        "SentimentScore": -1
      },
      {
        "name": "Scott P.",
        "title": "Efficient, Thorough, Feature-rich software",
        "text": [
          "Pros: I like the auditable features that allow companies to ensure they are protected. The continual refinement of existing tools and development of new tools is unparalleled. The customer support and service is excellent. The mobile apps are efficient, intuitive and easy to learn for people that may not be computer savvy. The addition of Procore sync is awesome and makes working exclusively in Procore easy and second nature.",
          "Cons: I don't like that some of the tools aren't as feature-rich as others. It is almost like they have been left on the back burner. The reporting tool needs updates to allow users to pull from the whole spectrum of information that exists in Procore. Some of the tools are cumbersome to work in, but I know they are constantly trying to improve the user experience and software functionality. The inability to determine how Procore emails display in a recipients inbox is detrimental to working with government clients. The need to be able to send emails as plain text emails is critical as government employees are not able to receive HTML emails. This requires us to do more work that and take unnecessary steps in order to work with that client. It also means our company cannot work solely within Procore we have to leave the program after exporting whatever we are working on to then send to the client."
        ],
        "time": "Feb 02, 2018",
        "Product": "CAPTERRA",
        "SentimentScore": 0
      },
      {
        "name": "Aaron S.",
        "title": "Excellent Project Management Software",
        "text": [
          "Pros: Procore is extremely user friendly. I like how anyone from the most technology-savvy to the least can pick up how to use the software. It puts the whole project in one place, which makes information sharing and management much more efficient. The interface is easy to understand and does not take click memorization to learn how to find what you're looking for. Having mobile inspections and drawings is critical, and the ability to add photos to any tool is extremely beneficial. Their observation module is ideal for quality control, and makes documentation simple and effective.",
          "Cons: The mobile app can be challenging in the fact that it is regularly changed, and not always for the better. It has happened multiple times where features were changed and there is no discernible benefit and it makes the experience worse. It would be helpful if Procore expanded their drawing markup tools to make them a bit more flexible when it comes to posting information to the plans, and Procore needs to simply it's submittal date calculation so that dates can be added during the submittal builder feature and the calculation feature works from any tool."
        ],
        "time": "Nov 27, 2018",
        "Product": "CAPTERRA",
        "SentimentScore": -1
      },
      {
        "name": "Brett B.",
        "title": "Procore has given us as a small company the power to give customers a high level of confidence in us",
        "text": [
          "Pros: Procore has given us as a small company the power to satisfy customers and develop a high level of confidence in us. The visibility to the customer of the project has been a great asset for them to not even have to visit the jobsite unless desired. My superintendents are able to utilize the functions and areas of Procore to help keep the project on track and document any problems with much less effort than previously. This in turn allows them to focus there time in the field and increase quality, safety and a team environment. The external added benefits have been a huge part of our company success.\n\nProcore is always improving and providing us with opportunities to streamline our processes and find ways for us to continue to excel. We implemented the Quickbooks integration and the financial tracking and oversight that this provides has been extremely valuable in controlling costs.",
          "Cons: The only downside that I currently have with Procore is that they continue to develop more tools than we have been able to keep up with implementing!"
        ],
        "time": "Feb 01, 2018",
        "Product": "CAPTERRA",
        "SentimentScore": -1
      },
      {
        "name": "Donnie B.",
        "title": "Top of the line project management software!",
        "text": [
          "Pros: There is so much to like about Procore. Some of the best things are: their support team, continuous improvement, mobile functionality, and integrations with other software.",
          "They have account champions that are required to have quarterly meetings with clients. This pushes us to continue to find new ways to use Procore. There are so many facets that we, as a company, are not used to being included with a project management solution. So it's good to have someone on the inside that will give us honest feedback, run trainings for us as needed, and connect us to the right people to learn more about Procore.",
          "Cons: The continuous improvement can change things that people are used to for a while and thus change best practices without communicating sometimes.",
          "It's also very expensive compared to previous legacy project management software. This is to be expected because there's so much more to it than previously.",
          "Overall: Overall, I have very little to complain about with Procore. Their customer service is top notch and they're providing a top of the class service!"
        ],
        "time": "Oct 17, 2018",
        "Product": "CAPTERRA",
        "SentimentScore": 1
      },
      {
        "name": "Matt S.",
        "title": "The most comprehensive construction management software!!",
        "text": [
          "Comments: Procore provides the most comprehensive construction management software for use on the Jobsite. Their software allows Project Managers, Superintendents, Foreman, Safety, Subcontractors, Suppliers, Engineers, Owners and other support staff to work together for the common goal of providing a project well organized and documented. Information flows easily through the system to all appropriate individuals and allows all involved access to any information they need at any time from any location. This software is very robust and is still improving every day. Support is one of Procore's best assets. It doesn't matter if you are a new user seeking an answer to a basic question or an advanced user looking a something very technical or needing added features the live chat and all other avenues of support are quick and knowledgeable to handle any issue. In my opinion, Procore is the gold standard of construction software and should be on the top any contractors list looking for a new document and project management system.",
          "Pros: The software as a whole is a very strong asset. I would also have to list their support, innovation, attention to detail, proactive stance on finding new solutions to old problems.",
          "Recommendations to other buyers: I can't say enough good things about this company and their software."
        ],
        "time": "Feb 09, 2017",
        "Product": "CAPTERRA",
        "SentimentScore": -1
      },
      {
        "name": "Clarissa W.",
        "title": "Absolutely love having all my projects and all the data for each in one place!",
        "text": [
          "Pros: Internet/cloud based - can work from and access project info anywhere!\n\nHolds all of my projects, my contacts, and all the data for every project in one easy-to-use program. Everything I need is accessible from home, office, or the field.\n\nPosting drawings and linking Documents, RFI's, Submittals, etc. is easy, and immediately updates those links and markups for everyone who needs to see them. I don't have to worry that one of my superintendents or subcontractors is building off of old drawings.\n\nWe are just starting to learn and set up the financial tools. I can already see the value in the way they work, and can track which subcontractors have and have not submitted change order pricing, or responded to a request for pricing.\n\nI love the photo albums. The owners and clients we work with also loving having their job site cameras linked to a project's home page.\n\nI'm incredibly impressed with the thoroughness of ProCore - if it's related to construction project management, ProCore has a Tool for it!!!",
          "Cons: It has been very time-consuming to set everything up, and a little difficult to get some of our design teams to buy in to using it. However, with a little training and explanation a lot of them are starting to see the value in ProCore and appreciate the functions it has."
        ],
        "time": "Feb 08, 2018",
        "Product": "CAPTERRA",
        "SentimentScore": 0
      },
      {
        "name": "Josh R.",
        "title": "Everything you need for your project, all in one place",
        "text": [
          "Comments: Procore is great, it has improved our company's operation.",
          "Pros: I love being able to add anyone to the directory and they immediately have access to the whole project. It makes it a very smooth transition for anyone joining in the middle of a project. Being able to edit drawings and show all current revisions is very convenient. Inspections tab is also very useful tool for me, as well as the ability to track daily activities, even timecard information. Also nice to have mobile capabilities.",
          "Cons: I'm not sure this is a con, but it would be nice to have some sort of integration capability with QuickBooks. Sometimes it feels as though doing double the work taking information from QB and entering into Procore, and the other way around. Also, I would like the ability to add new users to a project from the mobile app. I often get requests for access while in the field and have to just make note and enter when I am back at my desk, which is often some long amount of time later."
        ],
        "time": "Mar 23, 2017",
        "Product": "CAPTERRA",
        "SentimentScore": 0
      },
      {
        "name": "Eric E.",
        "title": "Works great if you take the time to learn it's features. Getting subs to use it can be challenging",
        "text": [
          "Pros: Everything in one location, drawing management, ability to track what has or hasn't been done. Procore support has been second to none and it's great to see a product that consistently makes improvements on a regular basis rather than every once and a while.",
          "Cons: 1. Scheduling tool is almost useless if you want to update it daily. The ability to create and modify the schedule without having to go through a third party would be a great improvement. The ability to do so from the app would be an added bonus.",
          "2. Great for managing an overall project but not great for workplace collaboration within your own company. I find many using other programs to help with that aspect and it would be great if procore allowed easier communication between project team members",
          "Overall: Accessibility is one of the big items. No longer do we have to look for a print, a file on a shared drive server or written note that had that important contact information on it. Benefits will continue to grow alongside procore as it continues to be improved upon"
        ],
        "time": "May 04, 2017",
        "Product": "CAPTERRA",
        "SentimentScore": 1
      },
      {
        "name": "Jim L.",
        "title": "USERCENTRIC Work Of Art",
        "text": [
          "Comments: From the first day we started looking for Construction Management software for our growing company, we were impressed by Procore's USERCENTRIC culture. The product serves our needs well and is constantly being improved, many times based on our comments and suggestions provided through our Customer Success Manager or their own \"Post An Idea\" section of the Support and Feedback tab. With the In-The-Cloud offering, we can access the software from any number of devices at any time of the day or night. Our collaboration use during the month is amazing with 2 out of 3 users being outside of our company- that being Owners, Architects and Subcontractors.",
          "Pros: The people and their attitude towards listening to any comments and acting on it. Their Customer Service is second to none! The completeness of the software accounting for any task that you need to perform on a construction project. Many of our users are up and running without any training given the ease of use of the software- very intuitive.",
          "Cons: N/A",
          "Recommendations to other buyers: Do your research and you will not find another company like Procore as far as customer service and ease of use!"
        ],
        "time": "Feb 15, 2017",
        "Product": "CAPTERRA",
        "SentimentScore": -1
      },
      {
        "name": "Neil L.",
        "title": "Great App",
        "text": [
          "Comments: My organization uses this app for document control (RFI, Submittals, Drawings, Meeting Minutes) as well as Safety and Quality. The interface is very intuitive and requires only a few minutes to become proficient - it is light years beyond its competitors. Procore has done a great job capturing the many facets of a construction project and created tools to manage those tasks all under one roof. Not only are the tools available but they are linked together behind-the-scenes to allow the users to chase down open items effortlessly.",
          "Pros: Intuitive and clean interface that can be viewed on a number of platforms (Chrome, Explorer, Edge, Fire Fox, Safari, and possibly others). The landing screen within each project gives a visual indication and within 10 seconds the user can gain an understanding of how the project is progressing. The ability to link documents to the drawings and have that information immediately available is an invaluable feature. Our teams no longer have to go back to the job trailer to look up an RFI or Submittall document in the filing cabinet. We have only been using it for 4 months and it is quickly gaining traction among our group and subcontractors.",
          "Cons: Some of the workflows just aren't set up for larger companies. Currently the RFI and Submittals, while they route through many of the same people, do not have the same workflow in Procore. Submittal workflow can be adjusted by the creator of the submittal whereas RFI's can only be assigned to one person. Sounds reasonable, however, submittals can be forwarded to other design personnel for review but the RFI's do not have the same flexibility. Importing into Procore is hit or miss. Some modules have an import option, some don't, some require the user to email the support team and have them perform the import on their behalf. It's up to the users to figure out which is which. Email is limited to only those users that are registered in Procore, meaning, I cannot email an RFI to anyone that does not have a registered email address with Procore. That limits my ability to collaborate with a project team."
        ],
        "time": "Mar 23, 2016",
        "Product": "CAPTERRA",
        "SentimentScore": 1
      },
      {
        "name": "alex z.",
        "title": "Tailored for a certain type of business",
        "text": [
          "Comments: Procore has helped us solve one of the fundamental problems we were experiencing. Multiple users using multiple softwares and files to track project level data, with no company wide consistency. Procore has helped us get all our project managers on the same platform using the same tools to manage day to day construction.",
          "Pros: Accelerated learning curve. Great support structure and staff. Solid base of tools to get the day to day stuff done. I'm a big fan for what it has done for us so far.",
          "Cons: Lack of an open platform like salesforce. Makes the development of custom tools difficult and very time consuming waiting for procore staff to create custom fit solutions. the platform as it stands now is not geared to multifamily projects with multiple buyer interactions, leaving us with cumbersome work arounds. Tools promised years ago still not delivered(such as adding change orders to specific cost codes versus a CO line item at the bottom of a G703), really hinders our full implementation."
        ],
        "time": "Apr 11, 2017",
        "Product": "CAPTERRA",
        "SentimentScore": -1
      },
      {
        "name": "Jerri C.",
        "title": "Procore makes my job easier!",
        "text": [
          "Comments: From time to time, it seems like the Live Chat is outsourced to another country. For a few months in the summer, I was sent online links to solve my problem. 10 times out of 10, they were pages I had visited BEFORE I started the Live Chat. When I get a \"link\" as a solution, I often will end the chat immediately and start over, hoping to get a different rep. OR I'll pick up the phone and call in order to talk to a live person. I hope Procore is not outsourcing... It doesn't work well.",
          "Pros: For ease of use, it's the videos, online message boards, live chat that make it doable. For features - again it's ease of use, the many tabs which to choose from, budget items, the fact it syncs with Sage accounting, the document control.",
          "Cons: The directory - adding existing contacts to other companies is very tricky, often un-doable if the e-mail is the same. So is deactivating them from the project/company. The Inspection tab - creating the pas/fail option to templates takes more time than it should. The Observation tab is more like the Inspection, less like a real observation of an area. I'd like to be able to enter several items from a one report, not create new observations for each individual cost code. The budget tool - once it's locked, it's locked! Requires a call to Procore. Interagting new software. My company switche from Quickbooks to Sage. Procore suppor was an integral part of the intergration. There was a delay on the Procore side. We are still waiting for Procore to finish their end of the \"bargin\". It's pricey!"
        ],
        "time": "Nov 14, 2018",
        "Product": "CAPTERRA",
        "SentimentScore": -1
      },
      {
        "name": "Michael B.",
        "title": "Procore Engagement ",
        "text": [
          "Pros: One single source of information ensures that all stakeholders on a project are working to the same information. It also provides full history of communications, when people are sent information and when information is required to be sent back. Contractually this is extremely important from a contractor point of view, as well as designer/sub-contractors. It also allows the Principal to be engaged with the project by allowing them access to the platform on whatever capacity you believe is required. Used correctly it can reduce time consuming and confusing email trails, as well as loss of information and key decisions.",
          "Cons: It can be hard to get full engagement from people, both within your organisation as well as others (subcontractors, clients and consultants). Once the platform is used and understood, people generally understand the positives and start to engage with the platform. Used to its full potential, there is gains for all to make, but its hard to get there, and our organisation are not there yet."
        ],
        "time": "Feb 28, 2019",
        "Product": "CAPTERRA",
        "SentimentScore": 1
      },
      {
        "name": "Cheryl R.",
        "title": "Procore has made a positive impact in many of our everyday tasks",
        "text": [
          "Pros: Being Cloud-based everyone has access to real-time information.",
          "You can't beat Procore's great customer support, from the easy to following online support manuals to the friendly Online chat option. Also, I really like the training videos and certifications. As the Training Coordinator of my company, I struggle each year to ensure that our employees receive 32 hours of outside training (one of our requirements). Procore makes it much easier for me to accomplish this. The certifications and other videos interest a variety of our employees. Also, Procore is easy to use. People usually adapt to it within a day or two.",
          "Cons: It is a pricey software, to be sure. In order for it to be more valuable, a company would have to use many of the modules to make it beneficial. Fortunately, we are pretty committed to using it as much as possible.",
          "Overall: It is easy to use. We strive to keep all our documents in one place, accessible to all team members and also be able to have records of what is sent when and to whom. The tracking of everthing all in one place is invaluable."
        ],
        "time": "May 05, 2017",
        "Product": "CAPTERRA",
        "SentimentScore": 0
      },
      {
        "name": "Verified Reviewer",
        "title": "We are Pro Procore!",
        "text": [
          "Pros: Procore's customer service team is by far the biggest benefit of this program. They are available almost 24/7 to help with any of the programs features, and are always able to get down to the bottom of what we might've logged incorrectly or why a feature isn't working for us. Data management is another huge pro. We love having all of our documentation in one place. We have had servers crash and lost all of our data in the past, so we know the value of knowing our project's data will always be there is a benefit we can't go without anymore. Another pro I will share is the ability to keep our clients informed from the project's conception to completion. Our clients love logging into their project and viewing the highlights we have given them permissions to see. It gives them confidence and trust in us as General Contractors."
        ],
        "time": "Feb 19, 2018",
        "Product": "CAPTERRA",
        "SentimentScore": 1
      },
      {
        "name": "Adam W.",
        "title": "Keeps getting better",
        "text": [
          "Comments: Also Certain positions don't use ALL the software (HR, or similar positions) but they do use time tracking productivity, and certain aspects, making the dashboard more custom to positions is do-able, but does take a while to go and click through, etc. What if there were certain dashboard types or home screens based on what your position was (Project manager, admin, HR, etc..) based on what information you needed to see vs others,etc..perhaps you can already do this and I'm just not aware of where to find it, (getting back to navigation and ease of use for \"newer\" users on procore.)",
          "Pros: Everything all in one place, once you get the hang of navigation its easy to move about. The addition of time tracking and productivity is great and allows it to become that much closer to an all inclusive/all you need software platform.",
          "Cons: I wish it was more intuitive/navigable upon initial use for someone who is completely unfamiliar with the software. I had to look around, and randomly click around before getting used to it. I know there are modules to watch and learn and those are helpful, but perhaps for new users that should pop up immediately and maybe not be mandatory to complete before moving forward, but definitely front and center as an option to view so that you aren't running blind out of the gate."
        ],
        "time": "Nov 14, 2018",
        "Product": "CAPTERRA",
        "SentimentScore": 0
      },
      {
        "name": "Jeff C.",
        "title": "Powerful",
        "text": [
          "Comments: I love PROCORE. I have used and touch many of the major software packages and PROCORE is the best so far. It is self-evident that it was designed to be a construction management software that helps a PM do what he needs to do. That is it. As it grows in functionality with the the Construction OS, I am confident it will just get better. Additionally, our Subs love it and use it. Our Field Teams love it and use it. Our Owners and Design Teams use it. Huge plus.",
          "Pros: As a Senior Project Manager looking after multiple projects being managed by younger APMs, I feel PROCORE gives me all the tools I need to keep track of the project's documentation and financial pictures. It will never replace walking the job, but when I can be there all of the time, I do have PROCORE helping me.",
          "Cons: Some of the features that have been rolled out have glitches or concerns or aren't perfect and it seems like with the focus on product growth, some features get stuck at 90% perfect."
        ],
        "time": "Apr 20, 2017",
        "Product": "CAPTERRA",
        "SentimentScore": 1
      },
      {
        "name": "Steven S.",
        "title": "Director of Operations",
        "text": [
          "Comments: When I was first approached by younger PM's that our company was in need of project management software, I was resistant. Spreadsheets and Word documents were working just fine for me when I was a PM. Our company looked at several competitors and landed with Procore after careful review of all factors. After two years in, I only wish we had procured this sooner! For the PM's that take the time to really get projects populated from the beginning, it makes for a much more efficient project. For upper management, it allows us to manage much more in our Portfolio and keep the management team a little leaner. If I see a well populated project in Procore from my desk, I can show a project that is keeping every team member happy while increasing our bottom line. If one is not properly populated, I can jump in and save the project from any further damage.",
          "Pros: Effective use of project information for dashboards and reporting to upper management. Ease in communication. Procore's automatic email reminders for deliverable due dates. ERP to our Timberline accounting software.",
          "Cons: Budget tool could be better for tracking proprietary profit margins.",
          "Recommendations to other buyers: Seek advice for the roll out process and engage the team at Procore."
        ],
        "time": "Feb 10, 2017",
        "Product": "CAPTERRA",
        "SentimentScore": 1
      },
      {
        "name": "Sean G.",
        "title": "Job Site Functionality and Mobility Enhanced",
        "text": [
          "Pros: Procore allows you tie your job site and office work almost seamlessly. The mobile app allows you to check submittals, documents, drawings, and specs on your phone without needing to be chained to your computer or to return to the trailer to look at a note on the plans or in the spec. It allows your photos to be uploaded to the same location as the photos your superintendent takes. And everything syncs up nearly perfectly with the desktop app that provides, even more, features and tools to efficiently manage your project.",
          "Cons: There are no major cons, just minor ones within individual tools. For example, not having the option to create sub-folders in the Photos Tool is odd. This is just basic folder structure that would allow the tool to be much cleaner. Another example is the inability to save files directly into Procore. Currently, you have to save them to your folder, then upload them to Procore. This is a lot of extra work if you want everything on your project in the palm of your hand."
        ],
        "time": "Apr 19, 2017",
        "Product": "CAPTERRA",
        "SentimentScore": -1
      },
      {
        "name": "Wil H.",
        "title": "User Friendly and a Time Savor",
        "text": [
          "Comments: I have been very impressed with my experience using Procore. As a project engineer for a construction management company, the Procore software has greatly reduced the amount of time I have to spend on submittals, RFI's, meeting minutes and project contacts. I no longer have to spend hours creating a submittal log in excel, sending countless notifications to the subcontractors, updating the submittal log with sub/owner responses, etc. The software is also very user friendly. Even our superintendents like it!",
          "Pros: - Very user friendly. - Live Chat customer support is very quick and effective in resolving issues. - Fairly easy to upload drawings and get them quickly labeled by drawing number and title. - Makes the submittal tracking process much easier. - Greatly eases the process of creating and tracking RFI's.",
          "Cons: - Still some improvements to make on submittal tracking. - Allowing for bulk edit of \"workflow\" in submittal packages. - Storing of submittal log preferences from one login to the next would save time in \"filtering\" the log. - Providing a \"notes\" section to the submittal log so that the GC can create private notes on the status of each submittal. An example would be if a sub calls to notify me that the samples have been ordered but won't be delivered for a week, When uploading drawings, sometimes the title blocks are vertical and not horizontal. When this happens the auto-recognition software does not auto-generate the title of the drawings. It would be nice to be able to use the software as a plan room for bidding. Having to enter each company manually just to send them an email to download the plans and specs is not very efficient. If I could just mass email a link from my email account, rather than having to enter a company name, phone numbers, contact info, etc. it would be a great time saver."
        ],
        "time": "Apr 17, 2015",
        "Product": "CAPTERRA",
        "SentimentScore": 0
      },
      {
        "name": "Kevin R.",
        "title": "Procore is hands down the most efficient and easiest to use of all of the construction specific collaboration suites that I have used.",
        "text": [
          "Comments: We have used this product for two years and recently renewed our subscription. It is my opinion that this is the most cost-effective and efficient document management system that is currently available.",
          "Pros: The drawing tool is tremendous. Drawing revisions can be uploaded, processed, collated and shared very easily, efficiently and accurately. The Publish/Do Not Publish feature allows sharing to be controlled as necessary through the pricing progression of a revision. The UI is hands down the best of any of the systems that I have used.",
          "Cons: The iOS and Droid apps are both very solid with many features and great functionality. We have recently switched form iPads to Windows-based tablets and have found that the Windows app lags significantly behind the other two in functionality as well as features. It seems to be catching up but has a long ways to go."
        ],
        "time": "Nov 14, 2018",
        "Product": "CAPTERRA",
        "SentimentScore": -1
      },
      {
        "name": "McArthur S.",
        "title": "Great tools, available to all users, constantly improving to make even better",
        "text": [
          "Pros: Procore has combined a great set of tools for managing our projects. We are no longer required to use several different softwares to achieve the results and quality of documentation and communication we strive for. Procore is the leader in the industry for CM software. Not only do they already provide a robust set of tools to use to manage our projects, but they continue to develop more tools and plug-ins as the industry demands them. Great customer service and response to listening to their customers needs. The app and field tools are outstanding.",
          "Cons: Like any software there are limitations. Our coordinators have some challenges with forecasting and issuing change orders the way they would prefer, but some of it is just learning to do things differently. The only other item i can think of is we would access to even more data. While the custom reporting tools are good they could be even better, but i believe Procore is already working on that!",
          "Overall: easy to use"
        ],
        "time": "Feb 02, 2018",
        "Product": "CAPTERRA",
        "SentimentScore": -1
      },
      {
        "name": "Jim L.",
        "title": "All In One Package",
        "text": [
          "Pros: Procore is an all-in-one package that provides functionality from start to finish of a project. In addition to the basic project management functions (bidding, RFI's, submittals, meeting minutes, etc...) I love the the Quality Control program capabilities including Inspections and Observations, which are critical as the job progresses. The ability to customize the input and output is critical and Procore has it included.",
          "Cons: If you can call it a con, is the constant updating of the software. While this software is cloud-based, the continuous improvements of the software is a great feature since it maintains the cutting-edge functionality.",
          "Overall: My experinece with Procore has been over the last 5+ years including implementation of the software across our company as well as customizing and maintaining the software since the initial implementation."
        ],
        "time": "Feb 12, 2019",
        "Product": "CAPTERRA",
        "SentimentScore": 0
      },
      {
        "name": "Angela E.",
        "title": "Awesome-Sauce",
        "text": [
          "Comments: I LOVE this software and would recommend it to anyone in the Construction Industry. Procore is standardizing the way the Construction Industry uses its technology through this software platform, while leaving the doors wide open for continued collaboration and customization with their app store based on each clients want and needs.",
          "Pros: They don't have the word \"Pro\" in Procore for no reason. This software is top of line for our industry and is being developed by the Pro's. I love that they have Construction Professionals on their team who have been in the industry and understand the thought process behind the processes. This alone now makes the interaction with your implementation managers, and account managers that much easier. In addition, the software it self is easy to use. I have trained so many technically challenged field Sups on this software and they have fallen in love with it ... not to mention our Project Managers and other associates in house.",
          "Cons: I just got back from Groundbreak and after seeing all of the new changes coming, I don't really have any major cons to report! I just look forward to those being implemented sooner rather than later as they will help tremendously with some of the current items that don't function the way they could."
        ],
        "time": "Apr 05, 2017",
        "Product": "CAPTERRA",
        "SentimentScore": 1
      },
      {
        "name": "David P.",
        "title": "If you want all your project information at your fingertips; this is for you.",
        "text": [
          "Comments: A great system to store, keep, track and manage all of your direct and indirect project information. From simple document control, to contracts, changes, through the punch list. A great insurance policy.",
          "Pros: One stop shop. The software can be used from Concept through close-out and is vital all the way through. It allows for either stand-alone of collaberative style projects.",
          "Cons: As a Project management tool; that is not just for project managers, then there are very view cons. Where any system falls down is when you are asking it to do more then it should. Accounting and Estimating should be separate. We want and need our PM's to take the estimate and \"Own\" it by resorting and importing the budget that \"they will buy as close to the final values as possible\" and accounting is simply to ensure that if you get audited you win and allows for cost excellence."
        ],
        "time": "Aug 09, 2017",
        "Product": "CAPTERRA",
        "SentimentScore": 0
      },
      {
        "name": "Bryan W.",
        "title": "Drawings, Specifications and RFI tools are fantastic!",
        "text": [
          "Pros: - Making their software very user friendly. Pretty easy to learn, and customizable to fit our needs.\n\n- Providing excellent customer support, where the people are always friendly, and readily available (not a 15 minute hold time away).\n\n- Developing an easy platform to navigate large project drawing books quickly, compare drawing revisions, and make notes on the drawings.",
          "Cons: - It's expensive and may be hard to justify for smaller construction companies.\n\n- Their OCR still has trouble reading \"handwriting\" fonts, which can really slow down the drawing uploading process.\n\n- Their Drawing system will not flip pages within a PDF. Occasionally, a GC will send us the pages turned portrait instead of landscape, and we have to use third party software to flip the pages the correct orientation.",
          "Overall: - Saves time in sorting drawings and specifications.\n\n- Saves time in compiling drawing notations for RFIs.\n\n- Saves time in being able to quickly compare drawing revisions, and confirm which revision is the most recent."
        ],
        "time": "Nov 09, 2017",
        "Product": "CAPTERRA",
        "SentimentScore": 0
      },
      {
        "name": "walker b.",
        "title": "Couldn't imagine not having the use of Procore as a Project Manager.",
        "text": [
          "Pros: Procore makes everything that much easier and having all these tools at the touch of your hand while on the jobsite has greatly improved the efficiency of construction on site. Communication is key in construction and Procore ties everything together from the architect to the subcontractors. I use Procore daily and it has made my life so much easier from having all the submittal information in one location to being able to create an RFI right at the jobsite and attach pictures to it. I don't have to go back to the office and create these tasks.",
          "Cons: Procore is an every changing software and I cannot say I dislike one thing about Procore. The customer service is absolutely outstanding.",
          "Overall: Procore makes life so much easier by being able to implement RFI's, Observations, Punchlists..etc. right from your mobile device."
        ],
        "time": "May 05, 2017",
        "Product": "CAPTERRA",
        "SentimentScore": -1
      },
      {
        "name": "Jason W.",
        "title": "Takes a lot of the work out of paperwork.",
        "text": [
          "Comments: Keep up the good work with the changes. Procore definitely listens to their customers and tries to keep up with all the practical comments.",
          "Pros: I always hated doing meeting agendas and minutes. In word it would take a lot longer to produce and format the document and then following up with the minutes afterwards. Procore takes the work out of it, all I have to do is create the item for discussion and then I can move it around in the meeting agenda before I send it out. Minutes after the fact are easy and then follow up meetings just carry everything forward that isn't closed. Writing, submitting and tracking RFIs and Submittals is also a lot easier with those modules. Less paperwork means I spend more time doing what needs to be done.",
          "Cons: There is always room for improvements. Our biggest issue is integration with our Financial software. We unfortunately use something that Procore is not equipped to handle, primarily because not too many are using it."
        ],
        "time": "May 06, 2017",
        "Product": "CAPTERRA",
        "SentimentScore": 0
      },
      {
        "name": "Debra K.",
        "title": "Procore - Review",
        "text": [
          "Comments: I have used Procore for Construction Management and now the other side to track RFIs, Submittals, Drawings, Specifications and Documents. For drawings this program will allow the user to see documents, sketches and markups on the drawings themselves. Specifications are readably available to review and search easily. RFIs and Submittals, notification of documents nearing or over due when you log in. As for the Construction Management side Change Orders to Owners and Subcontractors allows reminders of what is approved and what is not and it just tracks things you might not otherwise consider. Customized reports and no more adding to an Excel spreadsheet makes this program efficient as well as user friendly. Customer service is at your fingertips, with the ability to write a question and remain on the screen for direction and efficient answers within minutes. Online training shows how to use the tabs available with short videos. There is also written instructions that can be done through searching key words. This makes this product VERY USER FRIENDLY. This product is used all day long and very little down time.",
          "Pros: This product is so user friendly our contractors Project Engineer: Showed her how to submit RFIs and Submittals reviewing it with her on 5 documents. She is now proficient and with no assistance provides them to our PM daily. Customer service is at your fingertips, with the ability to write a question and remain on the screen for direction and efficient answers within minutes.",
          "Cons: After learning how to configure your project (easy to do) you can reduce the emails that go out. This is something that should be reviewed from the onset.",
          "Recommendations to other buyers: Configure your individual tabs."
        ],
        "time": "Dec 08, 2016",
        "Product": "CAPTERRA",
        "SentimentScore": -1
      },
      {
        "name": "Lori F.",
        "title": "ProCore is one stop shopping for your construction project management needs",
        "text": [
          "Pros: I love that ProCore is an inclusive product that is constantly evolving and growing to meet the greater need of global construction industry.",
          "Cons: I always want to know more! I am limited out of necessity. As an paper pusher and project admin for the architects and engineers, I know there is more to learn, but not necessary for my position.",
          "Overall: I am a project admin, so I don't get to experience the full sphere of what Procore has to offer on a daily basis, but I love the opportunity to learn through Builder's Club, the Challenges, and the University classes. ProCore as a company seems to stand for the betterment of the Constructions Industry, the Value and Safety of the People, and Economics of every detail from the Design table to Ribbon Cutting. I am grateful for the opportunity to be included and grow even though I wear heals and pearls instead of a hard hat and boots!"
        ],
        "time": "Oct 24, 2018",
        "Product": "CAPTERRA",
        "SentimentScore": -1
      },
      {
        "name": "Pawel D.",
        "title": "Perfect Software for Streamlining Work Between Departments",
        "text": [
          "Pros: Software is user friendly and very easy to navigate.",
          "Cons: A little improvement could be made in navigating between windows. For example, if I'm in the PCO level for one job, then going to PCO level on the next job I have to drill down through multiple layers.",
          "Overall: My primary use of Procore software revolves around accounting needs, such as setting up SOV, processing monthly requisitions, and creating change orders. Procore is very useful in addressing my needs especially when they extend beyond my department, such as areas addressing project management and administration. I would recommend this software for anyone who is in construction industry.",
          "Recommendations to other buyers: Under change order previews total, value should not be updated until change order gets approved. Some change orders get approved out of sequence, and previews total value includes change orders that have not been approved, which creates a over/under approved amount."
        ],
        "time": "Jul 19, 2016",
        "Product": "CAPTERRA",
        "SentimentScore": 1
      },
      {
        "name": "Victor A.",
        "title": "Procore Rules the Project Management Software field!",
        "text": [
          "Pros: Web Based Project Management Software that allows to merge project duties within a variety of options that allows integration with top leading software solutions in the construction field. Procore gives a easy navigation solutions, with an always tracking task feature over e-mail that will help you to leverage the tasks using defined roles. Procore Training path is well defined for each role within the construction project.",
          "Cons: It can be complicated sometimes and can take some time to learn about all the features. E-mail notifications can overwhelm the pace of first response to tasks assigned to project team members. It's expensive so think twice before you run into start a purchase process, if your construction project won't allow you to invest in such high quality project management software solution don't you precipitate you could find other cheaper solutions."
        ],
        "time": "May 06, 2018",
        "Product": "CAPTERRA",
        "SentimentScore": 0
      },
      {
        "name": "James C.",
        "title": "Great Time Saving Tool",
        "text": [
          "Pros: Procore allows seamless integration with a lot of other softwares which makes it easy to bring all types of information into one cohesive system. The functionality of the drawing module is phenomenal. The markups tool, revision numbering by date issued, and allowing you to easily scroll through previous versions is super helpful.",
          "Cons: There are some glitches in the submittal tool that don't allow you to change a workflow assignee from submitter to approver. I frequently run into an issue with RFIs where I cannot put \"Question received from\" a person different from the responsible contractor. In other words, if a mason raises a question about something that affects his work, but is really the work of a carpenter, it does not allow me to say that the question was received by the mason if it is the carpenter who will ultimately be responsible for doing the work."
        ],
        "time": "Nov 15, 2018",
        "Product": "CAPTERRA",
        "SentimentScore": 0
      },
      {
        "name": "Zachary B.",
        "title": "I've had great experiences with this software. Constantly promoted it and got new users to join.",
        "text": [
          "Pros: The software is constantly updating to people's input and recommendations. The website is very easy to navigate and the mobile app is just as easy. The documents load quickly and the search functions are very good. The automatic notification system is great and you are allowed to modify as preferred.",
          "Cons: The Cons I see are mainly in the way the accounts are set up on a company basis instead of a per project basis. It makes sense for some applications, but not useful for others.",
          "Overall: The ability to share and automatically notify a certain group of people without the need to remember to follow up with an email is nice. It also helps decrease the ability to forget someone if you distribute to the same group every time. It allows me to view my project(s) either on my computer or the iPad or iPhone."
        ],
        "time": "May 04, 2017",
        "Product": "CAPTERRA",
        "SentimentScore": 0
      }
    ]
  }
]